MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J94/mcu.h
// Register: RPOR6_7
#define RPOR6_7 RPOR6_7
extern volatile unsigned char           RPOR6_7             __at(0xE15);
#ifndef _LIB_BUILD
asm("RPOR6_7 equ 0E15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO6R                  :4;
        unsigned RPO7R                  :4;
    };
    struct {
        unsigned RPO6R0                 :1;
        unsigned RPO6R1                 :1;
        unsigned RPO6R2                 :1;
        unsigned RPO6R3                 :1;
        unsigned RPO7R0                 :1;
        unsigned RPO7R1                 :1;
        unsigned RPO7R2                 :1;
        unsigned RPO7R3                 :1;
    };
} RPOR6_7bits_t;
extern volatile RPOR6_7bits_t RPOR6_7bits __at(0xE15);
// bitfield macros
#define _RPOR6_7_RPO6R_POSN                                 0x0
#define _RPOR6_7_RPO6R_POSITION                             0x0
#define _RPOR6_7_RPO6R_SIZE                                 0x4
#define _RPOR6_7_RPO6R_LENGTH                               0x4
#define _RPOR6_7_RPO6R_MASK                                 0xF
#define _RPOR6_7_RPO7R_POSN                                 0x4
#define _RPOR6_7_RPO7R_POSITION                             0x4
#define _RPOR6_7_RPO7R_SIZE                                 0x4
#define _RPOR6_7_RPO7R_LENGTH                               0x4
#define _RPOR6_7_RPO7R_MASK                                 0xF0
#define _RPOR6_7_RPO6R0_POSN                                0x0
#define _RPOR6_7_RPO6R0_POSITION                            0x0
#define _RPOR6_7_RPO6R0_SIZE                                0x1
#define _RPOR6_7_RPO6R0_LENGTH                              0x1
#define _RPOR6_7_RPO6R0_MASK                                0x1
#define _RPOR6_7_RPO6R1_POSN                                0x1
#define _RPOR6_7_RPO6R1_POSITION                            0x1
#define _RPOR6_7_RPO6R1_SIZE                                0x1
#define _RPOR6_7_RPO6R1_LENGTH                              0x1
#define _RPOR6_7_RPO6R1_MASK                                0x2
#define _RPOR6_7_RPO6R2_POSN                                0x2
#define _RPOR6_7_RPO6R2_POSITION                            0x2
#define _RPOR6_7_RPO6R2_SIZE                                0x1
#define _RPOR6_7_RPO6R2_LENGTH                              0x1
#define _RPOR6_7_RPO6R2_MASK                                0x4
#define _RPOR6_7_RPO6R3_POSN                                0x3
#define _RPOR6_7_RPO6R3_POSITION                            0x3
#define _RPOR6_7_RPO6R3_SIZE                                0x1
#define _RPOR6_7_RPO6R3_LENGTH                              0x1
#define _RPOR6_7_RPO6R3_MASK                                0x8
#define _RPOR6_7_RPO7R0_POSN                                0x4
#define _RPOR6_7_RPO7R0_POSITION                            0x4
#define _RPOR6_7_RPO7R0_SIZE                                0x1
#define _RPOR6_7_RPO7R0_LENGTH                              0x1
#define _RPOR6_7_RPO7R0_MASK                                0x10
#define _RPOR6_7_RPO7R1_POSN                                0x5
#define _RPOR6_7_RPO7R1_POSITION                            0x5
#define _RPOR6_7_RPO7R1_SIZE                                0x1
#define _RPOR6_7_RPO7R1_LENGTH                              0x1
#define _RPOR6_7_RPO7R1_MASK                                0x20
#define _RPOR6_7_RPO7R2_POSN                                0x6
#define _RPOR6_7_RPO7R2_POSITION                            0x6
#define _RPOR6_7_RPO7R2_SIZE                                0x1
#define _RPOR6_7_RPO7R2_LENGTH                              0x1
#define _RPOR6_7_RPO7R2_MASK                                0x40
#define _RPOR6_7_RPO7R3_POSN                                0x7
#define _RPOR6_7_RPO7R3_POSITION                            0x7
#define _RPOR6_7_RPO7R3_SIZE                                0x1
#define _RPOR6_7_RPO7R3_LENGTH                              0x1
#define _RPOR6_7_RPO7R3_MASK                                0x80

// Register: RPOR8_9
#define RPOR8_9 RPOR8_9
extern volatile unsigned char           RPOR8_9             __at(0xE16);
#ifndef _LIB_BUILD
asm("RPOR8_9 equ 0E16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO8R                  :4;
        unsigned RPO9R                  :4;
    };
    struct {
        unsigned RPO8R0                 :1;
        unsigned RPO8R1                 :1;
        unsigned RPO8R2                 :1;
        unsigned RPO8R3                 :1;
        unsigned RPO9R0                 :1;
        unsigned RPO9R1                 :1;
        unsigned RPO9R2                 :1;
        unsigned RPO9R3                 :1;
    };
} RPOR8_9bits_t;
extern volatile RPOR8_9bits_t RPOR8_9bits __at(0xE16);
// bitfield macros
#define _RPOR8_9_RPO8R_POSN                                 0x0
#define _RPOR8_9_RPO8R_POSITION                             0x0
#define _RPOR8_9_RPO8R_SIZE                                 0x4
#define _RPOR8_9_RPO8R_LENGTH                               0x4
#define _RPOR8_9_RPO8R_MASK                                 0xF
#define _RPOR8_9_RPO9R_POSN                                 0x4
#define _RPOR8_9_RPO9R_POSITION                             0x4
#define _RPOR8_9_RPO9R_SIZE                                 0x4
#define _RPOR8_9_RPO9R_LENGTH                               0x4
#define _RPOR8_9_RPO9R_MASK                                 0xF0
#define _RPOR8_9_RPO8R0_POSN                                0x0
#define _RPOR8_9_RPO8R0_POSITION                            0x0
#define _RPOR8_9_RPO8R0_SIZE                                0x1
#define _RPOR8_9_RPO8R0_LENGTH                              0x1
#define _RPOR8_9_RPO8R0_MASK                                0x1
#define _RPOR8_9_RPO8R1_POSN                                0x1
#define _RPOR8_9_RPO8R1_POSITION                            0x1
#define _RPOR8_9_RPO8R1_SIZE                                0x1
#define _RPOR8_9_RPO8R1_LENGTH                              0x1
#define _RPOR8_9_RPO8R1_MASK                                0x2
#define _RPOR8_9_RPO8R2_POSN                                0x2
#define _RPOR8_9_RPO8R2_POSITION                            0x2
#define _RPOR8_9_RPO8R2_SIZE                                0x1
#define _RPOR8_9_RPO8R2_LENGTH                              0x1
#define _RPOR8_9_RPO8R2_MASK                                0x4
#define _RPOR8_9_RPO8R3_POSN                                0x3
#define _RPOR8_9_RPO8R3_POSITION                            0x3
#define _RPOR8_9_RPO8R3_SIZE                                0x1
#define _RPOR8_9_RPO8R3_LENGTH                              0x1
#define _RPOR8_9_RPO8R3_MASK                                0x8
#define _RPOR8_9_RPO9R0_POSN                                0x4
#define _RPOR8_9_RPO9R0_POSITION                            0x4
#define _RPOR8_9_RPO9R0_SIZE                                0x1
#define _RPOR8_9_RPO9R0_LENGTH                              0x1
#define _RPOR8_9_RPO9R0_MASK                                0x10
#define _RPOR8_9_RPO9R1_POSN                                0x5
#define _RPOR8_9_RPO9R1_POSITION                            0x5
#define _RPOR8_9_RPO9R1_SIZE                                0x1
#define _RPOR8_9_RPO9R1_LENGTH                              0x1
#define _RPOR8_9_RPO9R1_MASK                                0x20
#define _RPOR8_9_RPO9R2_POSN                                0x6
#define _RPOR8_9_RPO9R2_POSITION                            0x6
#define _RPOR8_9_RPO9R2_SIZE                                0x1
#define _RPOR8_9_RPO9R2_LENGTH                              0x1
#define _RPOR8_9_RPO9R2_MASK                                0x40
#define _RPOR8_9_RPO9R3_POSN                                0x7
#define _RPOR8_9_RPO9R3_POSITION                            0x7
#define _RPOR8_9_RPO9R3_SIZE                                0x1
#define _RPOR8_9_RPO9R3_LENGTH                              0x1
#define _RPOR8_9_RPO9R3_MASK                                0x80

// Register: RPOR10_11
#define RPOR10_11 RPOR10_11
extern volatile unsigned char           RPOR10_11           __at(0xE17);
#ifndef _LIB_BUILD
asm("RPOR10_11 equ 0E17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPO10R                 :4;
        unsigned RPO11R                 :4;
    };
    struct {
        unsigned RPO10R0                :1;
        unsigned RPO10R1                :1;
        unsigned RPO10R2                :1;
        unsigned RPO10R3                :1;
        unsigned RPO11R0                :1;
        unsigned RPO11R1                :1;
        unsigned RPO11R2                :1;
        unsigned RPO11R3                :1;
    };
} RPOR10_11bits_t;
extern volatile RPOR10_11bits_t RPOR10_11bits __at(0xE17);
// bitfield macros
#define _RPOR10_11_RPO10R_POSN                              0x0
#define _RPOR10_11_RPO10R_POSITION                          0x0
#define _RPOR10_11_RPO10R_SIZE                              0x4
#define _RPOR10_11_RPO10R_LENGTH                            0x4
#define _RPOR10_11_RPO10R_MASK                              0xF
#define _RPOR10_11_RPO11R_POSN                              0x4
#define _RPOR10_11_RPO11R_POSITION                          0x4
#define _RPOR10_11_RPO11R_SIZE                              0x4
#define _RPOR10_11_RPO11R_LENGTH                            0x4
#define _RPOR10_11_RPO11R_MASK                              0xF0
#define _RPOR10_11_RPO10R0_POSN                             0x0
#define _RPOR10_11_RPO10R0_POSITION                         0x0
#define _RPOR10_11_RPO10R0_SIZE                             0x1
#define _RPOR10_11_RPO10R0_LENGTH                           0x1
#define _RPOR10_11_RPO10R0_MASK                             0x1
#define _RPOR10_11_RPO10R1_POSN                             0x1
#define _RPOR10_11_RPO10R1_POSITION                         0x1
#define _RPOR10_11_RPO10R1_SIZE                             0x1
#define _RPOR10_11_RPO10R1_LENGTH                           0x1
#define _RPOR10_11_RPO10R1_MASK                             0x2
#define _RPOR10_11_RPO10R2_POSN                             0x2
#define _RPOR10_11_RPO10R2_POSITION                         0x2
#define _RPOR10_11_RPO10R2_SIZE                             0x1
#define _RPOR10_11_RPO10R2_LENGTH                           0x1
#define _RPOR10_11_RPO10R2_MASK                             0x4
#define _RPOR10_11_RPO10R3_POSN                             0x3
#define _RPOR10_11_RPO10R3_POSITION                         0x3
#define _RPOR10_11_RPO10R3_SIZE                             0x1
#define _RPOR10_11_RPO10R3_LENGTH                           0x1
#define _RPOR10_11_RPO10R3_MASK                             0x8
#define _RPOR10_11_RPO11R0_POSN                             0x4
#define _RPOR10_11_RPO11R0_POSITION                         0x4
#define _RPOR10_11_RPO11R0_SIZE                             0x1
#define _RPOR10_11_RPO11R0_LENGTH                           0x1
#define _RPOR10_11_RPO11R0_MASK                             0x10
#define _RPOR10_11_RPO11R1_POSN                             0x5
#define _RPOR10_11_RPO11R1_POSITION                         0x5
#define _RPOR10_11_RPO11R1_SIZE                             0x1
#define _RPOR10_11_RPO11R1_LENGTH                           0x1
#define _RPOR10_11_RPO11R1_MASK                             0x20
#define _RPOR10_11_RPO11R2_POSN                             0x6
#define _RPOR10_11_RPO11R2_POSITION                         0x6
#define _RPOR10_11_RPO11R2_SIZE                             0x1
#define _RPOR10_11_RPO11R2_LENGTH                           0x1
#define _RPOR10_11_RPO11R2_MASK                             0x40
#define _RPOR10_11_RPO11R3_POSN                             0x7
#define _RPOR10_11_RPO11R3_POSITION                         0x7
#define _RPOR10_11_RPO11R3_SIZE                             0x1
#define _RPOR10_11_RPO11R3_LENGTH                           0x1
#define _RPOR10_11_RPO11R3_MASK                             0x80

