MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J94/mcu.h
// Register: RPINR52_53
#define RPINR52_53 RPINR52_53
extern volatile unsigned char           RPINR52_53          __at(0xE44);
#ifndef _LIB_BUILD
asm("RPINR52_53 equ 0E44h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PBIO6R                 :4;
        unsigned PBIO7R                 :4;
    };
    struct {
        unsigned PBIO6R0                :1;
        unsigned PBIO6R1                :1;
        unsigned PBIO6R2                :1;
        unsigned PBIO6R3                :1;
        unsigned PBIO7R0                :1;
        unsigned PBIO7R1                :1;
        unsigned PBIO7R2                :1;
        unsigned PBIO7R3                :1;
    };
} RPINR52_53bits_t;
extern volatile RPINR52_53bits_t RPINR52_53bits __at(0xE44);
// bitfield macros
#define _RPINR52_53_PBIO6R_POSN                             0x0
#define _RPINR52_53_PBIO6R_POSITION                         0x0
#define _RPINR52_53_PBIO6R_SIZE                             0x4
#define _RPINR52_53_PBIO6R_LENGTH                           0x4
#define _RPINR52_53_PBIO6R_MASK                             0xF
#define _RPINR52_53_PBIO7R_POSN                             0x4
#define _RPINR52_53_PBIO7R_POSITION                         0x4
#define _RPINR52_53_PBIO7R_SIZE                             0x4
#define _RPINR52_53_PBIO7R_LENGTH                           0x4
#define _RPINR52_53_PBIO7R_MASK                             0xF0
#define _RPINR52_53_PBIO6R0_POSN                            0x0
#define _RPINR52_53_PBIO6R0_POSITION                        0x0
#define _RPINR52_53_PBIO6R0_SIZE                            0x1
#define _RPINR52_53_PBIO6R0_LENGTH                          0x1
#define _RPINR52_53_PBIO6R0_MASK                            0x1
#define _RPINR52_53_PBIO6R1_POSN                            0x1
#define _RPINR52_53_PBIO6R1_POSITION                        0x1
#define _RPINR52_53_PBIO6R1_SIZE                            0x1
#define _RPINR52_53_PBIO6R1_LENGTH                          0x1
#define _RPINR52_53_PBIO6R1_MASK                            0x2
#define _RPINR52_53_PBIO6R2_POSN                            0x2
#define _RPINR52_53_PBIO6R2_POSITION                        0x2
#define _RPINR52_53_PBIO6R2_SIZE                            0x1
#define _RPINR52_53_PBIO6R2_LENGTH                          0x1
#define _RPINR52_53_PBIO6R2_MASK                            0x4
#define _RPINR52_53_PBIO6R3_POSN                            0x3
#define _RPINR52_53_PBIO6R3_POSITION                        0x3
#define _RPINR52_53_PBIO6R3_SIZE                            0x1
#define _RPINR52_53_PBIO6R3_LENGTH                          0x1
#define _RPINR52_53_PBIO6R3_MASK                            0x8
#define _RPINR52_53_PBIO7R0_POSN                            0x4
#define _RPINR52_53_PBIO7R0_POSITION                        0x4
#define _RPINR52_53_PBIO7R0_SIZE                            0x1
#define _RPINR52_53_PBIO7R0_LENGTH                          0x1
#define _RPINR52_53_PBIO7R0_MASK                            0x10
#define _RPINR52_53_PBIO7R1_POSN                            0x5
#define _RPINR52_53_PBIO7R1_POSITION                        0x5
#define _RPINR52_53_PBIO7R1_SIZE                            0x1
#define _RPINR52_53_PBIO7R1_LENGTH                          0x1
#define _RPINR52_53_PBIO7R1_MASK                            0x20
#define _RPINR52_53_PBIO7R2_POSN                            0x6
#define _RPINR52_53_PBIO7R2_POSITION                        0x6
#define _RPINR52_53_PBIO7R2_SIZE                            0x1
#define _RPINR52_53_PBIO7R2_LENGTH                          0x1
#define _RPINR52_53_PBIO7R2_MASK                            0x40
#define _RPINR52_53_PBIO7R3_POSN                            0x7
#define _RPINR52_53_PBIO7R3_POSITION                        0x7
#define _RPINR52_53_PBIO7R3_SIZE                            0x1
#define _RPINR52_53_PBIO7R3_LENGTH                          0x1
#define _RPINR52_53_PBIO7R3_MASK                            0x80

// Register: ANCON3
#define ANCON3 ANCON3
extern volatile unsigned char           ANCON3              __at(0xE45);
#ifndef _LIB_BUILD
asm("ANCON3 equ 0E45h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSEL16                :1;
        unsigned ANSEL17                :1;
        unsigned ANSEL18                :1;
        unsigned ANSEL19                :1;
        unsigned ANSEL20                :1;
        unsigned ANSEL21                :1;
        unsigned ANSEL22                :1;
        unsigned ANSEL23                :1;
    };
} ANCON3bits_t;
extern volatile ANCON3bits_t ANCON3bits __at(0xE45);
// bitfield macros
#define _ANCON3_ANSEL16_POSN                                0x0
#define _ANCON3_ANSEL16_POSITION                            0x0
#define _ANCON3_ANSEL16_SIZE                                0x1
#define _ANCON3_ANSEL16_LENGTH                              0x1
#define _ANCON3_ANSEL16_MASK                                0x1
#define _ANCON3_ANSEL17_POSN                                0x1
#define _ANCON3_ANSEL17_POSITION                            0x1
#define _ANCON3_ANSEL17_SIZE                                0x1
#define _ANCON3_ANSEL17_LENGTH                              0x1
#define _ANCON3_ANSEL17_MASK                                0x2
#define _ANCON3_ANSEL18_POSN                                0x2
#define _ANCON3_ANSEL18_POSITION                            0x2
#define _ANCON3_ANSEL18_SIZE                                0x1
#define _ANCON3_ANSEL18_LENGTH                              0x1
#define _ANCON3_ANSEL18_MASK                                0x4
#define _ANCON3_ANSEL19_POSN                                0x3
#define _ANCON3_ANSEL19_POSITION                            0x3
#define _ANCON3_ANSEL19_SIZE                                0x1
#define _ANCON3_ANSEL19_LENGTH                              0x1
#define _ANCON3_ANSEL19_MASK                                0x8
#define _ANCON3_ANSEL20_POSN                                0x4
#define _ANCON3_ANSEL20_POSITION                            0x4
#define _ANCON3_ANSEL20_SIZE                                0x1
#define _ANCON3_ANSEL20_LENGTH                              0x1
#define _ANCON3_ANSEL20_MASK                                0x10
#define _ANCON3_ANSEL21_POSN                                0x5
#define _ANCON3_ANSEL21_POSITION                            0x5
#define _ANCON3_ANSEL21_SIZE                                0x1
#define _ANCON3_ANSEL21_LENGTH                              0x1
#define _ANCON3_ANSEL21_MASK                                0x20
#define _ANCON3_ANSEL22_POSN                                0x6
#define _ANCON3_ANSEL22_POSITION                            0x6
#define _ANCON3_ANSEL22_SIZE                                0x1
#define _ANCON3_ANSEL22_LENGTH                              0x1
#define _ANCON3_ANSEL22_MASK                                0x40
#define _ANCON3_ANSEL23_POSN                                0x7
#define _ANCON3_ANSEL23_POSITION                            0x7
#define _ANCON3_ANSEL23_SIZE                                0x1
#define _ANCON3_ANSEL23_LENGTH                              0x1
#define _ANCON3_ANSEL23_MASK                                0x80

