MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J94/mcu.h
// Register: ADCBUF13H
#define ADCBUF13H ADCBUF13H
extern volatile unsigned char           ADCBUF13H           __at(0xE61);
#ifndef _LIB_BUILD
asm("ADCBUF13H equ 0E61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF13H              :8;
    };
} ADCBUF13Hbits_t;
extern volatile ADCBUF13Hbits_t ADCBUF13Hbits __at(0xE61);
// bitfield macros
#define _ADCBUF13H_ADCBUF13H_POSN                           0x0
#define _ADCBUF13H_ADCBUF13H_POSITION                       0x0
#define _ADCBUF13H_ADCBUF13H_SIZE                           0x8
#define _ADCBUF13H_ADCBUF13H_LENGTH                         0x8
#define _ADCBUF13H_ADCBUF13H_MASK                           0xFF

// Register: ADCBUF14
#define ADCBUF14 ADCBUF14
extern volatile unsigned short          ADCBUF14            __at(0xE62);
#ifndef _LIB_BUILD
asm("ADCBUF14 equ 0E62h");
#endif

// Register: ADCBUF14L
#define ADCBUF14L ADCBUF14L
extern volatile unsigned char           ADCBUF14L           __at(0xE62);
#ifndef _LIB_BUILD
asm("ADCBUF14L equ 0E62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF14L              :8;
    };
} ADCBUF14Lbits_t;
extern volatile ADCBUF14Lbits_t ADCBUF14Lbits __at(0xE62);
// bitfield macros
#define _ADCBUF14L_ADCBUF14L_POSN                           0x0
#define _ADCBUF14L_ADCBUF14L_POSITION                       0x0
#define _ADCBUF14L_ADCBUF14L_SIZE                           0x8
#define _ADCBUF14L_ADCBUF14L_LENGTH                         0x8
#define _ADCBUF14L_ADCBUF14L_MASK                           0xFF

// Register: ADCBUF14H
#define ADCBUF14H ADCBUF14H
extern volatile unsigned char           ADCBUF14H           __at(0xE63);
#ifndef _LIB_BUILD
asm("ADCBUF14H equ 0E63h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF14H              :8;
    };
} ADCBUF14Hbits_t;
extern volatile ADCBUF14Hbits_t ADCBUF14Hbits __at(0xE63);
// bitfield macros
#define _ADCBUF14H_ADCBUF14H_POSN                           0x0
#define _ADCBUF14H_ADCBUF14H_POSITION                       0x0
#define _ADCBUF14H_ADCBUF14H_SIZE                           0x8
#define _ADCBUF14H_ADCBUF14H_LENGTH                         0x8
#define _ADCBUF14H_ADCBUF14H_MASK                           0xFF

// Register: ADCBUF15
#define ADCBUF15 ADCBUF15
extern volatile unsigned short          ADCBUF15            __at(0xE64);
#ifndef _LIB_BUILD
asm("ADCBUF15 equ 0E64h");
#endif

// Register: ADCBUF15L
#define ADCBUF15L ADCBUF15L
extern volatile unsigned char           ADCBUF15L           __at(0xE64);
#ifndef _LIB_BUILD
asm("ADCBUF15L equ 0E64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF15L              :8;
    };
} ADCBUF15Lbits_t;
extern volatile ADCBUF15Lbits_t ADCBUF15Lbits __at(0xE64);
// bitfield macros
#define _ADCBUF15L_ADCBUF15L_POSN                           0x0
#define _ADCBUF15L_ADCBUF15L_POSITION                       0x0
#define _ADCBUF15L_ADCBUF15L_SIZE                           0x8
#define _ADCBUF15L_ADCBUF15L_LENGTH                         0x8
#define _ADCBUF15L_ADCBUF15L_MASK                           0xFF

// Register: ADCBUF15H
#define ADCBUF15H ADCBUF15H
extern volatile unsigned char           ADCBUF15H           __at(0xE65);
#ifndef _LIB_BUILD
asm("ADCBUF15H equ 0E65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF15H              :8;
    };
} ADCBUF15Hbits_t;
extern volatile ADCBUF15Hbits_t ADCBUF15Hbits __at(0xE65);
// bitfield macros
#define _ADCBUF15H_ADCBUF15H_POSN                           0x0
#define _ADCBUF15H_ADCBUF15H_POSITION                       0x0
#define _ADCBUF15H_ADCBUF15H_SIZE                           0x8
#define _ADCBUF15H_ADCBUF15H_LENGTH                         0x8
#define _ADCBUF15H_ADCBUF15H_MASK                           0xFF

// Register: ADCBUF16
#define ADCBUF16 ADCBUF16
extern volatile unsigned short          ADCBUF16            __at(0xE66);
#ifndef _LIB_BUILD
asm("ADCBUF16 equ 0E66h");
#endif

// Register: ADCBUF16L
#define ADCBUF16L ADCBUF16L
extern volatile unsigned char           ADCBUF16L           __at(0xE66);
#ifndef _LIB_BUILD
asm("ADCBUF16L equ 0E66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF16L              :8;
    };
} ADCBUF16Lbits_t;
extern volatile ADCBUF16Lbits_t ADCBUF16Lbits __at(0xE66);
// bitfield macros
#define _ADCBUF16L_ADCBUF16L_POSN                           0x0
#define _ADCBUF16L_ADCBUF16L_POSITION                       0x0
#define _ADCBUF16L_ADCBUF16L_SIZE                           0x8
#define _ADCBUF16L_ADCBUF16L_LENGTH                         0x8
#define _ADCBUF16L_ADCBUF16L_MASK                           0xFF

// Register: ADCBUF16H
#define ADCBUF16H ADCBUF16H
extern volatile unsigned char           ADCBUF16H           __at(0xE67);
#ifndef _LIB_BUILD
asm("ADCBUF16H equ 0E67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF16H              :8;
    };
} ADCBUF16Hbits_t;
extern volatile ADCBUF16Hbits_t ADCBUF16Hbits __at(0xE67);
// bitfield macros
#define _ADCBUF16H_ADCBUF16H_POSN                           0x0
#define _ADCBUF16H_ADCBUF16H_POSITION                       0x0
#define _ADCBUF16H_ADCBUF16H_SIZE                           0x8
#define _ADCBUF16H_ADCBUF16H_LENGTH                         0x8
#define _ADCBUF16H_ADCBUF16H_MASK                           0xFF

// Register: ADCBUF17
#define ADCBUF17 ADCBUF17
extern volatile unsigned short          ADCBUF17            __at(0xE68);
#ifndef _LIB_BUILD
asm("ADCBUF17 equ 0E68h");
#endif

// Register: ADCBUF17L
#define ADCBUF17L ADCBUF17L
extern volatile unsigned char           ADCBUF17L           __at(0xE68);
#ifndef _LIB_BUILD
asm("ADCBUF17L equ 0E68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF17L              :8;
    };
} ADCBUF17Lbits_t;
extern volatile ADCBUF17Lbits_t ADCBUF17Lbits __at(0xE68);
// bitfield macros
#define _ADCBUF17L_ADCBUF17L_POSN                           0x0
#define _ADCBUF17L_ADCBUF17L_POSITION                       0x0
#define _ADCBUF17L_ADCBUF17L_SIZE                           0x8
#define _ADCBUF17L_ADCBUF17L_LENGTH                         0x8
#define _ADCBUF17L_ADCBUF17L_MASK                           0xFF

