MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J94/mcu.h
// Register: LCDDATA29
#define LCDDATA29 LCDDATA29
extern volatile unsigned char           LCDDATA29           __at(0xEAB);
#ifndef _LIB_BUILD
asm("LCDDATA29 equ 0EABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C3                  :1;
        unsigned S41C3                  :1;
        unsigned S42C3                  :1;
        unsigned S43C3                  :1;
        unsigned S44C3                  :1;
        unsigned S45C3                  :1;
        unsigned S46C3                  :1;
        unsigned S47C3                  :1;
    };
} LCDDATA29bits_t;
extern volatile LCDDATA29bits_t LCDDATA29bits __at(0xEAB);
// bitfield macros
#define _LCDDATA29_S40C3_POSN                               0x0
#define _LCDDATA29_S40C3_POSITION                           0x0
#define _LCDDATA29_S40C3_SIZE                               0x1
#define _LCDDATA29_S40C3_LENGTH                             0x1
#define _LCDDATA29_S40C3_MASK                               0x1
#define _LCDDATA29_S41C3_POSN                               0x1
#define _LCDDATA29_S41C3_POSITION                           0x1
#define _LCDDATA29_S41C3_SIZE                               0x1
#define _LCDDATA29_S41C3_LENGTH                             0x1
#define _LCDDATA29_S41C3_MASK                               0x2
#define _LCDDATA29_S42C3_POSN                               0x2
#define _LCDDATA29_S42C3_POSITION                           0x2
#define _LCDDATA29_S42C3_SIZE                               0x1
#define _LCDDATA29_S42C3_LENGTH                             0x1
#define _LCDDATA29_S42C3_MASK                               0x4
#define _LCDDATA29_S43C3_POSN                               0x3
#define _LCDDATA29_S43C3_POSITION                           0x3
#define _LCDDATA29_S43C3_SIZE                               0x1
#define _LCDDATA29_S43C3_LENGTH                             0x1
#define _LCDDATA29_S43C3_MASK                               0x8
#define _LCDDATA29_S44C3_POSN                               0x4
#define _LCDDATA29_S44C3_POSITION                           0x4
#define _LCDDATA29_S44C3_SIZE                               0x1
#define _LCDDATA29_S44C3_LENGTH                             0x1
#define _LCDDATA29_S44C3_MASK                               0x10
#define _LCDDATA29_S45C3_POSN                               0x5
#define _LCDDATA29_S45C3_POSITION                           0x5
#define _LCDDATA29_S45C3_SIZE                               0x1
#define _LCDDATA29_S45C3_LENGTH                             0x1
#define _LCDDATA29_S45C3_MASK                               0x20
#define _LCDDATA29_S46C3_POSN                               0x6
#define _LCDDATA29_S46C3_POSITION                           0x6
#define _LCDDATA29_S46C3_SIZE                               0x1
#define _LCDDATA29_S46C3_LENGTH                             0x1
#define _LCDDATA29_S46C3_MASK                               0x40
#define _LCDDATA29_S47C3_POSN                               0x7
#define _LCDDATA29_S47C3_POSITION                           0x7
#define _LCDDATA29_S47C3_SIZE                               0x1
#define _LCDDATA29_S47C3_LENGTH                             0x1
#define _LCDDATA29_S47C3_MASK                               0x80

// Register: LCDDATA30
#define LCDDATA30 LCDDATA30
extern volatile unsigned char           LCDDATA30           __at(0xEAC);
#ifndef _LIB_BUILD
asm("LCDDATA30 equ 0EACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S48C3                  :1;
        unsigned S49C3                  :1;
        unsigned S50C3                  :1;
        unsigned S51C3                  :1;
        unsigned S52C3                  :1;
        unsigned S53C3                  :1;
        unsigned S54C3                  :1;
        unsigned S55C3                  :1;
    };
} LCDDATA30bits_t;
extern volatile LCDDATA30bits_t LCDDATA30bits __at(0xEAC);
// bitfield macros
#define _LCDDATA30_S48C3_POSN                               0x0
#define _LCDDATA30_S48C3_POSITION                           0x0
#define _LCDDATA30_S48C3_SIZE                               0x1
#define _LCDDATA30_S48C3_LENGTH                             0x1
#define _LCDDATA30_S48C3_MASK                               0x1
#define _LCDDATA30_S49C3_POSN                               0x1
#define _LCDDATA30_S49C3_POSITION                           0x1
#define _LCDDATA30_S49C3_SIZE                               0x1
#define _LCDDATA30_S49C3_LENGTH                             0x1
#define _LCDDATA30_S49C3_MASK                               0x2
#define _LCDDATA30_S50C3_POSN                               0x2
#define _LCDDATA30_S50C3_POSITION                           0x2
#define _LCDDATA30_S50C3_SIZE                               0x1
#define _LCDDATA30_S50C3_LENGTH                             0x1
#define _LCDDATA30_S50C3_MASK                               0x4
#define _LCDDATA30_S51C3_POSN                               0x3
#define _LCDDATA30_S51C3_POSITION                           0x3
#define _LCDDATA30_S51C3_SIZE                               0x1
#define _LCDDATA30_S51C3_LENGTH                             0x1
#define _LCDDATA30_S51C3_MASK                               0x8
#define _LCDDATA30_S52C3_POSN                               0x4
#define _LCDDATA30_S52C3_POSITION                           0x4
#define _LCDDATA30_S52C3_SIZE                               0x1
#define _LCDDATA30_S52C3_LENGTH                             0x1
#define _LCDDATA30_S52C3_MASK                               0x10
#define _LCDDATA30_S53C3_POSN                               0x5
#define _LCDDATA30_S53C3_POSITION                           0x5
#define _LCDDATA30_S53C3_SIZE                               0x1
#define _LCDDATA30_S53C3_LENGTH                             0x1
#define _LCDDATA30_S53C3_MASK                               0x20
#define _LCDDATA30_S54C3_POSN                               0x6
#define _LCDDATA30_S54C3_POSITION                           0x6
#define _LCDDATA30_S54C3_SIZE                               0x1
#define _LCDDATA30_S54C3_LENGTH                             0x1
#define _LCDDATA30_S54C3_MASK                               0x40
#define _LCDDATA30_S55C3_POSN                               0x7
#define _LCDDATA30_S55C3_POSITION                           0x7
#define _LCDDATA30_S55C3_SIZE                               0x1
#define _LCDDATA30_S55C3_LENGTH                             0x1
#define _LCDDATA30_S55C3_MASK                               0x80

// Register: LCDDATA31
#define LCDDATA31 LCDDATA31
extern volatile unsigned char           LCDDATA31           __at(0xEAD);
#ifndef _LIB_BUILD
asm("LCDDATA31 equ 0EADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S56C3                  :1;
        unsigned S57C3                  :1;
        unsigned S58C3                  :1;
        unsigned S59C3                  :1;
        unsigned S60C3                  :1;
        unsigned S61C3                  :1;
        unsigned S62C3                  :1;
        unsigned S63C3                  :1;
    };
} LCDDATA31bits_t;
extern volatile LCDDATA31bits_t LCDDATA31bits __at(0xEAD);
// bitfield macros
#define _LCDDATA31_S56C3_POSN                               0x0
#define _LCDDATA31_S56C3_POSITION                           0x0
#define _LCDDATA31_S56C3_SIZE                               0x1
#define _LCDDATA31_S56C3_LENGTH                             0x1
#define _LCDDATA31_S56C3_MASK                               0x1
#define _LCDDATA31_S57C3_POSN                               0x1
#define _LCDDATA31_S57C3_POSITION                           0x1
#define _LCDDATA31_S57C3_SIZE                               0x1
#define _LCDDATA31_S57C3_LENGTH                             0x1
#define _LCDDATA31_S57C3_MASK                               0x2
#define _LCDDATA31_S58C3_POSN                               0x2
#define _LCDDATA31_S58C3_POSITION                           0x2
#define _LCDDATA31_S58C3_SIZE                               0x1
#define _LCDDATA31_S58C3_LENGTH                             0x1
#define _LCDDATA31_S58C3_MASK                               0x4
#define _LCDDATA31_S59C3_POSN                               0x3
#define _LCDDATA31_S59C3_POSITION                           0x3
#define _LCDDATA31_S59C3_SIZE                               0x1
#define _LCDDATA31_S59C3_LENGTH                             0x1
#define _LCDDATA31_S59C3_MASK                               0x8
#define _LCDDATA31_S60C3_POSN                               0x4
#define _LCDDATA31_S60C3_POSITION                           0x4
#define _LCDDATA31_S60C3_SIZE                               0x1
#define _LCDDATA31_S60C3_LENGTH                             0x1
#define _LCDDATA31_S60C3_MASK                               0x10
#define _LCDDATA31_S61C3_POSN                               0x5
#define _LCDDATA31_S61C3_POSITION                           0x5
#define _LCDDATA31_S61C3_SIZE                               0x1
#define _LCDDATA31_S61C3_LENGTH                             0x1
#define _LCDDATA31_S61C3_MASK                               0x20
#define _LCDDATA31_S62C3_POSN                               0x6
#define _LCDDATA31_S62C3_POSITION                           0x6
#define _LCDDATA31_S62C3_SIZE                               0x1
#define _LCDDATA31_S62C3_LENGTH                             0x1
#define _LCDDATA31_S62C3_MASK                               0x40
#define _LCDDATA31_S63C3_POSN                               0x7
#define _LCDDATA31_S63C3_POSITION                           0x7
#define _LCDDATA31_S63C3_SIZE                               0x1
#define _LCDDATA31_S63C3_LENGTH                             0x1
#define _LCDDATA31_S63C3_MASK                               0x80

// Register: LCDDATA32
#define LCDDATA32 LCDDATA32
extern volatile unsigned char           LCDDATA32           __at(0xEAE);
#ifndef _LIB_BUILD
asm("LCDDATA32 equ 0EAEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S00C4                  :1;
        unsigned S01C4                  :1;
        unsigned S02C4                  :1;
        unsigned S03C4                  :1;
        unsigned S04C4                  :1;
        unsigned S05C4                  :1;
        unsigned S06C4                  :1;
        unsigned S07C4                  :1;
    };
} LCDDATA32bits_t;
