MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J94/mcu.h
// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0xEF4);
#ifndef _LIB_BUILD
asm("PMD0 equ 0EF4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ECCP3MD                :1;
        unsigned CCP4MD                 :1;
        unsigned CCP5MD                 :1;
        unsigned CCP6MD                 :1;
        unsigned CCP7MD                 :1;
        unsigned CCP8MD                 :1;
        unsigned CCP9MD                 :1;
        unsigned CCP10MD                :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1MD                 :1;
        unsigned SPI2MD                 :1;
    };
} PMD0bits_t;
extern volatile PMD0bits_t PMD0bits __at(0xEF4);
// bitfield macros
#define _PMD0_ECCP3MD_POSN                                  0x0
#define _PMD0_ECCP3MD_POSITION                              0x0
#define _PMD0_ECCP3MD_SIZE                                  0x1
#define _PMD0_ECCP3MD_LENGTH                                0x1
#define _PMD0_ECCP3MD_MASK                                  0x1
#define _PMD0_CCP4MD_POSN                                   0x1
#define _PMD0_CCP4MD_POSITION                               0x1
#define _PMD0_CCP4MD_SIZE                                   0x1
#define _PMD0_CCP4MD_LENGTH                                 0x1
#define _PMD0_CCP4MD_MASK                                   0x2
#define _PMD0_CCP5MD_POSN                                   0x2
#define _PMD0_CCP5MD_POSITION                               0x2
#define _PMD0_CCP5MD_SIZE                                   0x1
#define _PMD0_CCP5MD_LENGTH                                 0x1
#define _PMD0_CCP5MD_MASK                                   0x4
#define _PMD0_CCP6MD_POSN                                   0x3
#define _PMD0_CCP6MD_POSITION                               0x3
#define _PMD0_CCP6MD_SIZE                                   0x1
#define _PMD0_CCP6MD_LENGTH                                 0x1
#define _PMD0_CCP6MD_MASK                                   0x8
#define _PMD0_CCP7MD_POSN                                   0x4
#define _PMD0_CCP7MD_POSITION                               0x4
#define _PMD0_CCP7MD_SIZE                                   0x1
#define _PMD0_CCP7MD_LENGTH                                 0x1
#define _PMD0_CCP7MD_MASK                                   0x10
#define _PMD0_CCP8MD_POSN                                   0x5
#define _PMD0_CCP8MD_POSITION                               0x5
#define _PMD0_CCP8MD_SIZE                                   0x1
#define _PMD0_CCP8MD_LENGTH                                 0x1
#define _PMD0_CCP8MD_MASK                                   0x20
#define _PMD0_CCP9MD_POSN                                   0x6
#define _PMD0_CCP9MD_POSITION                               0x6
#define _PMD0_CCP9MD_SIZE                                   0x1
#define _PMD0_CCP9MD_LENGTH                                 0x1
#define _PMD0_CCP9MD_MASK                                   0x40
#define _PMD0_CCP10MD_POSN                                  0x7
#define _PMD0_CCP10MD_POSITION                              0x7
#define _PMD0_CCP10MD_SIZE                                  0x1
#define _PMD0_CCP10MD_LENGTH                                0x1
#define _PMD0_CCP10MD_MASK                                  0x80
#define _PMD0_SPI1MD_POSN                                   0x1
#define _PMD0_SPI1MD_POSITION                               0x1
#define _PMD0_SPI1MD_SIZE                                   0x1
#define _PMD0_SPI1MD_LENGTH                                 0x1
#define _PMD0_SPI1MD_MASK                                   0x2
#define _PMD0_SPI2MD_POSN                                   0x2
#define _PMD0_SPI2MD_POSITION                               0x2
#define _PMD0_SPI2MD_SIZE                                   0x1
#define _PMD0_SPI2MD_LENGTH                                 0x1
#define _PMD0_SPI2MD_MASK                                   0x4

// Register: CTMUCON4
#define CTMUCON4 CTMUCON4
extern volatile unsigned char           CTMUCON4            __at(0xEF5);
#ifndef _LIB_BUILD
asm("CTMUCON4 equ 0EF5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EDG1STAT               :1;
        unsigned EDG2STAT               :1;
        unsigned EDG1SEL                :4;
        unsigned EDG1POL                :1;
        unsigned EDG1EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned EDG1SEL0               :1;
        unsigned EDG1SEL1               :1;
        unsigned EDG1SEL2               :1;
        unsigned EDG1SEL3               :1;
    };
} CTMUCON4bits_t;
extern volatile CTMUCON4bits_t CTMUCON4bits __at(0xEF5);
// bitfield macros
#define _CTMUCON4_EDG1STAT_POSN                             0x0
#define _CTMUCON4_EDG1STAT_POSITION                         0x0
#define _CTMUCON4_EDG1STAT_SIZE                             0x1
#define _CTMUCON4_EDG1STAT_LENGTH                           0x1
#define _CTMUCON4_EDG1STAT_MASK                             0x1
#define _CTMUCON4_EDG2STAT_POSN                             0x1
#define _CTMUCON4_EDG2STAT_POSITION                         0x1
#define _CTMUCON4_EDG2STAT_SIZE                             0x1
#define _CTMUCON4_EDG2STAT_LENGTH                           0x1
#define _CTMUCON4_EDG2STAT_MASK                             0x2
#define _CTMUCON4_EDG1SEL_POSN                              0x2
#define _CTMUCON4_EDG1SEL_POSITION                          0x2
#define _CTMUCON4_EDG1SEL_SIZE                              0x4
#define _CTMUCON4_EDG1SEL_LENGTH                            0x4
#define _CTMUCON4_EDG1SEL_MASK                              0x3C
#define _CTMUCON4_EDG1POL_POSN                              0x6
#define _CTMUCON4_EDG1POL_POSITION                          0x6
#define _CTMUCON4_EDG1POL_SIZE                              0x1
#define _CTMUCON4_EDG1POL_LENGTH                            0x1
#define _CTMUCON4_EDG1POL_MASK                              0x40
#define _CTMUCON4_EDG1EN_POSN                               0x7
#define _CTMUCON4_EDG1EN_POSITION                           0x7
#define _CTMUCON4_EDG1EN_SIZE                               0x1
#define _CTMUCON4_EDG1EN_LENGTH                             0x1
#define _CTMUCON4_EDG1EN_MASK                               0x80
#define _CTMUCON4_EDG1SEL0_POSN                             0x2
#define _CTMUCON4_EDG1SEL0_POSITION                         0x2
#define _CTMUCON4_EDG1SEL0_SIZE                             0x1
#define _CTMUCON4_EDG1SEL0_LENGTH                           0x1
#define _CTMUCON4_EDG1SEL0_MASK                             0x4
#define _CTMUCON4_EDG1SEL1_POSN                             0x3
#define _CTMUCON4_EDG1SEL1_POSITION                         0x3
#define _CTMUCON4_EDG1SEL1_SIZE                             0x1
#define _CTMUCON4_EDG1SEL1_LENGTH                           0x1
#define _CTMUCON4_EDG1SEL1_MASK                             0x8
#define _CTMUCON4_EDG1SEL2_POSN                             0x4
#define _CTMUCON4_EDG1SEL2_POSITION                         0x4
#define _CTMUCON4_EDG1SEL2_SIZE                             0x1
#define _CTMUCON4_EDG1SEL2_LENGTH                           0x1
#define _CTMUCON4_EDG1SEL2_MASK                             0x10
#define _CTMUCON4_EDG1SEL3_POSN                             0x5
#define _CTMUCON4_EDG1SEL3_POSITION                         0x5
#define _CTMUCON4_EDG1SEL3_SIZE                             0x1
#define _CTMUCON4_EDG1SEL3_LENGTH                           0x1
#define _CTMUCON4_EDG1SEL3_MASK                             0x20

