MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J94/mcu.h
// Register: PORTVP
#define PORTVP PORTVP
extern volatile unsigned char           PORTVP              __at(0xF71);
#ifndef _LIB_BUILD
asm("PORTVP equ 0F71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RVP0                   :1;
        unsigned RVP1                   :1;
        unsigned RVP2                   :1;
        unsigned RVP3                   :1;
        unsigned RVP4                   :1;
        unsigned RVP5                   :1;
        unsigned RVP6                   :1;
        unsigned RVP7                   :1;
    };
} PORTVPbits_t;
extern volatile PORTVPbits_t PORTVPbits __at(0xF71);
// bitfield macros
#define _PORTVP_RVP0_POSN                                   0x0
#define _PORTVP_RVP0_POSITION                               0x0
#define _PORTVP_RVP0_SIZE                                   0x1
#define _PORTVP_RVP0_LENGTH                                 0x1
#define _PORTVP_RVP0_MASK                                   0x1
#define _PORTVP_RVP1_POSN                                   0x1
#define _PORTVP_RVP1_POSITION                               0x1
#define _PORTVP_RVP1_SIZE                                   0x1
#define _PORTVP_RVP1_LENGTH                                 0x1
#define _PORTVP_RVP1_MASK                                   0x2
#define _PORTVP_RVP2_POSN                                   0x2
#define _PORTVP_RVP2_POSITION                               0x2
#define _PORTVP_RVP2_SIZE                                   0x1
#define _PORTVP_RVP2_LENGTH                                 0x1
#define _PORTVP_RVP2_MASK                                   0x4
#define _PORTVP_RVP3_POSN                                   0x3
#define _PORTVP_RVP3_POSITION                               0x3
#define _PORTVP_RVP3_SIZE                                   0x1
#define _PORTVP_RVP3_LENGTH                                 0x1
#define _PORTVP_RVP3_MASK                                   0x8
#define _PORTVP_RVP4_POSN                                   0x4
#define _PORTVP_RVP4_POSITION                               0x4
#define _PORTVP_RVP4_SIZE                                   0x1
#define _PORTVP_RVP4_LENGTH                                 0x1
#define _PORTVP_RVP4_MASK                                   0x10
#define _PORTVP_RVP5_POSN                                   0x5
#define _PORTVP_RVP5_POSITION                               0x5
#define _PORTVP_RVP5_SIZE                                   0x1
#define _PORTVP_RVP5_LENGTH                                 0x1
#define _PORTVP_RVP5_MASK                                   0x20
#define _PORTVP_RVP6_POSN                                   0x6
#define _PORTVP_RVP6_POSITION                               0x6
#define _PORTVP_RVP6_SIZE                                   0x1
#define _PORTVP_RVP6_LENGTH                                 0x1
#define _PORTVP_RVP6_MASK                                   0x40
#define _PORTVP_RVP7_POSN                                   0x7
#define _PORTVP_RVP7_POSITION                               0x7
#define _PORTVP_RVP7_SIZE                                   0x1
#define _PORTVP_RVP7_LENGTH                                 0x1
#define _PORTVP_RVP7_MASK                                   0x80

// Register: LATVP
#define LATVP LATVP
extern volatile unsigned char           LATVP               __at(0xF72);
#ifndef _LIB_BUILD
asm("LATVP equ 0F72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATVP0                 :1;
        unsigned LATVP1                 :1;
        unsigned LATVP2                 :1;
        unsigned LATVP3                 :1;
        unsigned LATVP4                 :1;
        unsigned LATVP5                 :1;
        unsigned LATVP6                 :1;
        unsigned LATVP7                 :1;
    };
} LATVPbits_t;
extern volatile LATVPbits_t LATVPbits __at(0xF72);
// bitfield macros
#define _LATVP_LATVP0_POSN                                  0x0
#define _LATVP_LATVP0_POSITION                              0x0
#define _LATVP_LATVP0_SIZE                                  0x1
#define _LATVP_LATVP0_LENGTH                                0x1
#define _LATVP_LATVP0_MASK                                  0x1
#define _LATVP_LATVP1_POSN                                  0x1
#define _LATVP_LATVP1_POSITION                              0x1
#define _LATVP_LATVP1_SIZE                                  0x1
#define _LATVP_LATVP1_LENGTH                                0x1
#define _LATVP_LATVP1_MASK                                  0x2
#define _LATVP_LATVP2_POSN                                  0x2
#define _LATVP_LATVP2_POSITION                              0x2
#define _LATVP_LATVP2_SIZE                                  0x1
#define _LATVP_LATVP2_LENGTH                                0x1
#define _LATVP_LATVP2_MASK                                  0x4
#define _LATVP_LATVP3_POSN                                  0x3
#define _LATVP_LATVP3_POSITION                              0x3
#define _LATVP_LATVP3_SIZE                                  0x1
#define _LATVP_LATVP3_LENGTH                                0x1
#define _LATVP_LATVP3_MASK                                  0x8
#define _LATVP_LATVP4_POSN                                  0x4
#define _LATVP_LATVP4_POSITION                              0x4
#define _LATVP_LATVP4_SIZE                                  0x1
#define _LATVP_LATVP4_LENGTH                                0x1
#define _LATVP_LATVP4_MASK                                  0x10
#define _LATVP_LATVP5_POSN                                  0x5
#define _LATVP_LATVP5_POSITION                              0x5
#define _LATVP_LATVP5_SIZE                                  0x1
#define _LATVP_LATVP5_LENGTH                                0x1
#define _LATVP_LATVP5_MASK                                  0x20
#define _LATVP_LATVP6_POSN                                  0x6
#define _LATVP_LATVP6_POSITION                              0x6
#define _LATVP_LATVP6_SIZE                                  0x1
#define _LATVP_LATVP6_LENGTH                                0x1
#define _LATVP_LATVP6_MASK                                  0x40
#define _LATVP_LATVP7_POSN                                  0x7
#define _LATVP_LATVP7_POSITION                              0x7
#define _LATVP_LATVP7_SIZE                                  0x1
#define _LATVP_LATVP7_LENGTH                                0x1
#define _LATVP_LATVP7_MASK                                  0x80

// Register: TRISVP
#define TRISVP TRISVP
extern volatile unsigned char           TRISVP              __at(0xF73);
#ifndef _LIB_BUILD
asm("TRISVP equ 0F73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISVP0                :1;
        unsigned TRISVP1                :1;
        unsigned TRISVP2                :1;
        unsigned TRISVP3                :1;
        unsigned TRISVP4                :1;
        unsigned TRISVP5                :1;
        unsigned TRISVP6                :1;
        unsigned TRISVP7                :1;
    };
} TRISVPbits_t;
extern volatile TRISVPbits_t TRISVPbits __at(0xF73);
// bitfield macros
#define _TRISVP_TRISVP0_POSN                                0x0
#define _TRISVP_TRISVP0_POSITION                            0x0
#define _TRISVP_TRISVP0_SIZE                                0x1
#define _TRISVP_TRISVP0_LENGTH                              0x1
#define _TRISVP_TRISVP0_MASK                                0x1
#define _TRISVP_TRISVP1_POSN                                0x1
#define _TRISVP_TRISVP1_POSITION                            0x1
#define _TRISVP_TRISVP1_SIZE                                0x1
#define _TRISVP_TRISVP1_LENGTH                              0x1
#define _TRISVP_TRISVP1_MASK                                0x2
#define _TRISVP_TRISVP2_POSN                                0x2
#define _TRISVP_TRISVP2_POSITION                            0x2
#define _TRISVP_TRISVP2_SIZE                                0x1
#define _TRISVP_TRISVP2_LENGTH                              0x1
#define _TRISVP_TRISVP2_MASK                                0x4
#define _TRISVP_TRISVP3_POSN                                0x3
#define _TRISVP_TRISVP3_POSITION                            0x3
#define _TRISVP_TRISVP3_SIZE                                0x1
#define _TRISVP_TRISVP3_LENGTH                              0x1
#define _TRISVP_TRISVP3_MASK                                0x8
#define _TRISVP_TRISVP4_POSN                                0x4
#define _TRISVP_TRISVP4_POSITION                            0x4
#define _TRISVP_TRISVP4_SIZE                                0x1
#define _TRISVP_TRISVP4_LENGTH                              0x1
#define _TRISVP_TRISVP4_MASK                                0x10
#define _TRISVP_TRISVP5_POSN                                0x5
#define _TRISVP_TRISVP5_POSITION                            0x5
#define _TRISVP_TRISVP5_SIZE                                0x1
#define _TRISVP_TRISVP5_LENGTH                              0x1
#define _TRISVP_TRISVP5_MASK                                0x20
#define _TRISVP_TRISVP6_POSN                                0x6
#define _TRISVP_TRISVP6_POSITION                            0x6
#define _TRISVP_TRISVP6_SIZE                                0x1
#define _TRISVP_TRISVP6_LENGTH                              0x1
#define _TRISVP_TRISVP6_MASK                                0x40
#define _TRISVP_TRISVP7_POSN                                0x7
#define _TRISVP_TRISVP7_POSITION                            0x7
#define _TRISVP_TRISVP7_SIZE                                0x1
#define _TRISVP_TRISVP7_LENGTH                              0x1
#define _TRISVP_TRISVP7_MASK                                0x80

// Register: UADDR
#define UADDR UADDR
extern volatile unsigned char           UADDR               __at(0xF74);
#ifndef _LIB_BUILD
asm("UADDR equ 0F74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADDR                   :7;
    };
    struct {
        unsigned ADDR0                  :1;
        unsigned ADDR1                  :1;
        unsigned ADDR2                  :1;
        unsigned ADDR3                  :1;
        unsigned ADDR4                  :1;
        unsigned ADDR5                  :1;
        unsigned ADDR6                  :1;
    };
} UADDRbits_t;
extern volatile UADDRbits_t UADDRbits __at(0xF74);
// bitfield macros
#define _UADDR_ADDR_POSN                                    0x0
#define _UADDR_ADDR_POSITION                                0x0
#define _UADDR_ADDR_SIZE                                    0x7
#define _UADDR_ADDR_LENGTH                                  0x7
#define _UADDR_ADDR_MASK                                    0x7F
#define _UADDR_ADDR0_POSN                                   0x0
#define _UADDR_ADDR0_POSITION                               0x0
#define _UADDR_ADDR0_SIZE                                   0x1
#define _UADDR_ADDR0_LENGTH                                 0x1
#define _UADDR_ADDR0_MASK                                   0x1
#define _UADDR_ADDR1_POSN                                   0x1
#define _UADDR_ADDR1_POSITION                               0x1
#define _UADDR_ADDR1_SIZE                                   0x1
#define _UADDR_ADDR1_LENGTH                                 0x1
#define _UADDR_ADDR1_MASK                                   0x2
#define _UADDR_ADDR2_POSN                                   0x2
#define _UADDR_ADDR2_POSITION                               0x2
#define _UADDR_ADDR2_SIZE                                   0x1
#define _UADDR_ADDR2_LENGTH                                 0x1
#define _UADDR_ADDR2_MASK                                   0x4
#define _UADDR_ADDR3_POSN                                   0x3
#define _UADDR_ADDR3_POSITION                               0x3
#define _UADDR_ADDR3_SIZE                                   0x1
#define _UADDR_ADDR3_LENGTH                                 0x1
#define _UADDR_ADDR3_MASK                                   0x8
#define _UADDR_ADDR4_POSN                                   0x4
#define _UADDR_ADDR4_POSITION                               0x4
#define _UADDR_ADDR4_SIZE                                   0x1
#define _UADDR_ADDR4_LENGTH                                 0x1
#define _UADDR_ADDR4_MASK                                   0x10
#define _UADDR_ADDR5_POSN                                   0x5
#define _UADDR_ADDR5_POSITION                               0x5
#define _UADDR_ADDR5_SIZE                                   0x1
#define _UADDR_ADDR5_LENGTH                                 0x1
#define _UADDR_ADDR5_MASK                                   0x20
#define _UADDR_ADDR6_POSN                                   0x6
#define _UADDR_ADDR6_POSITION                               0x6
#define _UADDR_ADDR6_SIZE                                   0x1
#define _UADDR_ADDR6_LENGTH                                 0x1
#define _UADDR_ADDR6_MASK                                   0x40

