MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J94/mcu.h
#define                                 MODMD_bit           _BIT_ACCESS(PMD3,7)
// SSP1ADD<MSK01>
extern volatile __bit                   MSK01               __at(0x7E40);	// @ (0xFC8 * 8 + 0)
#define                                 MSK01_bit           _BIT_ACCESS(SSP1ADD,0)
// SSP2ADD<MSK02>
extern volatile __bit                   MSK02               __at(0x7810);	// @ (0xF02 * 8 + 0)
#define                                 MSK02_bit           _BIT_ACCESS(SSP2ADD,0)
// SSP1ADD<MSK11>
extern volatile __bit                   MSK11               __at(0x7E41);	// @ (0xFC8 * 8 + 1)
#define                                 MSK11_bit           _BIT_ACCESS(SSP1ADD,1)
// SSP2ADD<MSK12>
extern volatile __bit                   MSK12               __at(0x7811);	// @ (0xF02 * 8 + 1)
#define                                 MSK12_bit           _BIT_ACCESS(SSP2ADD,1)
// SSP1ADD<MSK21>
extern volatile __bit                   MSK21               __at(0x7E42);	// @ (0xFC8 * 8 + 2)
#define                                 MSK21_bit           _BIT_ACCESS(SSP1ADD,2)
// SSP2ADD<MSK22>
extern volatile __bit                   MSK22               __at(0x7812);	// @ (0xF02 * 8 + 2)
#define                                 MSK22_bit           _BIT_ACCESS(SSP2ADD,2)
// SSP1ADD<MSK31>
extern volatile __bit                   MSK31               __at(0x7E43);	// @ (0xFC8 * 8 + 3)
#define                                 MSK31_bit           _BIT_ACCESS(SSP1ADD,3)
// SSP2ADD<MSK32>
extern volatile __bit                   MSK32               __at(0x7813);	// @ (0xF02 * 8 + 3)
#define                                 MSK32_bit           _BIT_ACCESS(SSP2ADD,3)
// SSP1ADD<MSK41>
extern volatile __bit                   MSK41               __at(0x7E44);	// @ (0xFC8 * 8 + 4)
#define                                 MSK41_bit           _BIT_ACCESS(SSP1ADD,4)
// SSP2ADD<MSK42>
extern volatile __bit                   MSK42               __at(0x7814);	// @ (0xF02 * 8 + 4)
#define                                 MSK42_bit           _BIT_ACCESS(SSP2ADD,4)
// SSP1ADD<MSK51>
extern volatile __bit                   MSK51               __at(0x7E45);	// @ (0xFC8 * 8 + 5)
#define                                 MSK51_bit           _BIT_ACCESS(SSP1ADD,5)
// SSP2ADD<MSK52>
extern volatile __bit                   MSK52               __at(0x7815);	// @ (0xF02 * 8 + 5)
#define                                 MSK52_bit           _BIT_ACCESS(SSP2ADD,5)
// SSP1ADD<MSK61>
extern volatile __bit                   MSK61               __at(0x7E46);	// @ (0xFC8 * 8 + 6)
#define                                 MSK61_bit           _BIT_ACCESS(SSP1ADD,6)
// SSP2ADD<MSK62>
extern volatile __bit                   MSK62               __at(0x7816);	// @ (0xF02 * 8 + 6)
#define                                 MSK62_bit           _BIT_ACCESS(SSP2ADD,6)
// SSP1ADD<MSK71>
extern volatile __bit                   MSK71               __at(0x7E47);	// @ (0xFC8 * 8 + 7)
#define                                 MSK71_bit           _BIT_ACCESS(SSP1ADD,7)
// SSP2ADD<MSK72>
extern volatile __bit                   MSK72               __at(0x7817);	// @ (0xF02 * 8 + 7)
#define                                 MSK72_bit           _BIT_ACCESS(SSP2ADD,7)
// STATUS<NEGATIVE>
extern volatile __bit                   NEGATIVE            __at(0x7EC4);	// @ (0xFD8 * 8 + 4)
#define                                 NEGATIVE_bit        _BIT_ACCESS(STATUS,4)
// OSCCON<NOSC0>
extern volatile __bit                   NOSC0               __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON,0)
// OSCCON<NOSC1>
extern volatile __bit                   NOSC1               __at(0x7E99);	// @ (0xFD3 * 8 + 1)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON,1)
// OSCCON<NOSC2>
extern volatile __bit                   NOSC2               __at(0x7E9A);	// @ (0xFD3 * 8 + 2)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON,2)
// SSP1STAT<NOT_ADDRESS1>
extern volatile __bit                   NOT_ADDRESS1        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 NOT_ADDRESS1_bit    _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<NOT_ADDRESS2>
extern volatile __bit                   NOT_ADDRESS2        __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 NOT_ADDRESS2_bit    _BIT_ACCESS(SSP2STAT,5)
// RCON<NOT_BOR>
extern volatile __bit                   NOT_BOR             __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 NOT_BOR_bit         _BIT_ACCESS(RCON,0)
// RCON<NOT_CM>
extern volatile __bit                   NOT_CM              __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 NOT_CM_bit          _BIT_ACCESS(RCON,5)
// RCON<NOT_PD>
extern volatile __bit                   NOT_PD              __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 NOT_PD_bit          _BIT_ACCESS(RCON,2)
// RCON<NOT_POR>
extern volatile __bit                   NOT_POR             __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 NOT_POR_bit         _BIT_ACCESS(RCON,1)
// INTCON2<NOT_RBPU>
extern volatile __bit                   NOT_RBPU            __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 NOT_RBPU_bit        _BIT_ACCESS(INTCON2,7)
// RCON<NOT_RI>
extern volatile __bit                   NOT_RI              __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 NOT_RI_bit          _BIT_ACCESS(RCON,4)
// T1GCON<NOT_T1DONE>
extern volatile __bit                   NOT_T1DONE          __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 NOT_T1DONE_bit      _BIT_ACCESS(T1GCON,3)
// T1CON<NOT_T1SYNC>
extern volatile __bit                   NOT_T1SYNC          __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 NOT_T1SYNC_bit      _BIT_ACCESS(T1CON,2)
// T3GCON<NOT_T3DONE>
extern volatile __bit                   NOT_T3DONE          __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 NOT_T3DONE_bit      _BIT_ACCESS(T3GCON,3)
// T3CON<NOT_T3SYNC>
extern volatile __bit                   NOT_T3SYNC          __at(0x7D8A);	// @ (0xFB1 * 8 + 2)
#define                                 NOT_T3SYNC_bit      _BIT_ACCESS(T3CON,2)
// T5GCON<NOT_T5DONE>
extern volatile __bit                   NOT_T5DONE          __at(0x789B);	// @ (0xF13 * 8 + 3)
#define                                 NOT_T5DONE_bit      _BIT_ACCESS(T5GCON,3)
// T5CON<NOT_T5SYNC>
extern volatile __bit                   NOT_T5SYNC          __at(0x78A2);	// @ (0xF14 * 8 + 2)
#define                                 NOT_T5SYNC_bit      _BIT_ACCESS(T5CON,2)
// RCON<NOT_TO>
extern volatile __bit                   NOT_TO              __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 NOT_TO_bit          _BIT_ACCESS(RCON,3)
// SSP1STAT<NOT_WRITE1>
extern volatile __bit                   NOT_WRITE1          __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_WRITE1_bit      _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<NOT_WRITE2>
extern volatile __bit                   NOT_WRITE2          __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 NOT_WRITE2_bit      _BIT_ACCESS(SSP2STAT,2)
// ADCON2H<NVCFG0>
extern volatile __bit                   NVCFG0              __at(0x746D);	// @ (0xE8D * 8 + 5)
#define                                 NVCFG0_bit          _BIT_ACCESS(ADCON2H,5)
// PSPCON<OBF>
extern volatile __bit                   OBF                 __at(0x7D3E);	// @ (0xFA7 * 8 + 6)
#define                                 OBF_bit             _BIT_ACCESS(PSPCON,6)
// ADCON2H<OFFCAL>
extern volatile __bit                   OFFCAL              __at(0x746C);	// @ (0xE8D * 8 + 4)
#define                                 OFFCAL_bit          _BIT_ACCESS(ADCON2H,4)
// PIE2<OSCFIE>
extern volatile __bit                   OSCFIE              __at(0x7D07);	// @ (0xFA0 * 8 + 7)
#define                                 OSCFIE_bit          _BIT_ACCESS(PIE2,7)
// PIR2<OSCFIF>
extern volatile __bit                   OSCFIF              __at(0x7D0F);	// @ (0xFA1 * 8 + 7)
#define                                 OSCFIF_bit          _BIT_ACCESS(PIR2,7)
// IPR2<OSCFIP>
extern volatile __bit                   OSCFIP              __at(0x7D17);	// @ (0xFA2 * 8 + 7)
#define                                 OSCFIP_bit          _BIT_ACCESS(IPR2,7)
// STATUS<OV>
extern volatile __bit                   OV                  __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OV_bit              _BIT_ACCESS(STATUS,3)
// STATUS<OVERFLOW>
extern volatile __bit                   OVERFLOW            __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OVERFLOW_bit        _BIT_ACCESS(STATUS,3)
// ECCP1DEL<P1DC0>
extern volatile __bit                   P1DC0               __at(0x7DE0);	// @ (0xFBC * 8 + 0)
#define                                 P1DC0_bit           _BIT_ACCESS(ECCP1DEL,0)
// PSTR1CON<P1DC02>
extern volatile __bit                   P1DC02              __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 P1DC02_bit          _BIT_ACCESS(PSTR1CON,0)
// PSTR1CON<P1DC0CON>
extern volatile __bit                   P1DC0CON            __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 P1DC0CON_bit        _BIT_ACCESS(PSTR1CON,0)
// ECCP1DEL<P1DC1>
extern volatile __bit                   P1DC1               __at(0x7DE1);	// @ (0xFBC * 8 + 1)
#define                                 P1DC1_bit           _BIT_ACCESS(ECCP1DEL,1)
// PSTR1CON<P1DC12>
extern volatile __bit                   P1DC12              __at(0x7CE1);	// @ (0xF9C * 8 + 1)
#define                                 P1DC12_bit          _BIT_ACCESS(PSTR1CON,1)
// PSTR1CON<P1DC1CON>
extern volatile __bit                   P1DC1CON            __at(0x7CE1);	// @ (0xF9C * 8 + 1)
#define                                 P1DC1CON_bit        _BIT_ACCESS(PSTR1CON,1)
// ECCP1DEL<P1DC2>
extern volatile __bit                   P1DC2               __at(0x7DE2);	// @ (0xFBC * 8 + 2)
#define                                 P1DC2_bit           _BIT_ACCESS(ECCP1DEL,2)
// PSTR1CON<P1DC22>
extern volatile __bit                   P1DC22              __at(0x7CE2);	// @ (0xF9C * 8 + 2)
#define                                 P1DC22_bit          _BIT_ACCESS(PSTR1CON,2)
// PSTR1CON<P1DC2CON>
extern volatile __bit                   P1DC2CON            __at(0x7CE2);	// @ (0xF9C * 8 + 2)
#define                                 P1DC2CON_bit        _BIT_ACCESS(PSTR1CON,2)
// ECCP1DEL<P1DC3>
extern volatile __bit                   P1DC3               __at(0x7DE3);	// @ (0xFBC * 8 + 3)
#define                                 P1DC3_bit           _BIT_ACCESS(ECCP1DEL,3)
// PSTR1CON<P1DC32>
extern volatile __bit                   P1DC32              __at(0x7CE3);	// @ (0xF9C * 8 + 3)
#define                                 P1DC32_bit          _BIT_ACCESS(PSTR1CON,3)
// PSTR1CON<P1DC3CON>
extern volatile __bit                   P1DC3CON            __at(0x7CE3);	// @ (0xF9C * 8 + 3)
#define                                 P1DC3CON_bit        _BIT_ACCESS(PSTR1CON,3)
// ECCP1DEL<P1DC4>
extern volatile __bit                   P1DC4               __at(0x7DE4);	// @ (0xFBC * 8 + 4)
#define                                 P1DC4_bit           _BIT_ACCESS(ECCP1DEL,4)
// PSTR1CON<P1DC42>
extern volatile __bit                   P1DC42              __at(0x7CE4);	// @ (0xF9C * 8 + 4)
#define                                 P1DC42_bit          _BIT_ACCESS(PSTR1CON,4)
// PSTR1CON<P1DC4CON>
extern volatile __bit                   P1DC4CON            __at(0x7CE4);	// @ (0xF9C * 8 + 4)
#define                                 P1DC4CON_bit        _BIT_ACCESS(PSTR1CON,4)
// ECCP1DEL<P1DC5>
extern volatile __bit                   P1DC5               __at(0x7DE5);	// @ (0xFBC * 8 + 5)
#define                                 P1DC5_bit           _BIT_ACCESS(ECCP1DEL,5)
// ECCP1DEL<P1DC6>
extern volatile __bit                   P1DC6               __at(0x7DE6);	// @ (0xFBC * 8 + 6)
#define                                 P1DC6_bit           _BIT_ACCESS(ECCP1DEL,6)
// PSTR1CON<P1DC62>
extern volatile __bit                   P1DC62              __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 P1DC62_bit          _BIT_ACCESS(PSTR1CON,6)
// PSTR1CON<P1DC6CON>
extern volatile __bit                   P1DC6CON            __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 P1DC6CON_bit        _BIT_ACCESS(PSTR1CON,6)
// CCP1CON<P1M0>
extern volatile __bit                   P1M0                __at(0x7DCE);	// @ (0xFB9 * 8 + 6)
#define                                 P1M0_bit            _BIT_ACCESS(CCP1CON,6)
// CCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x7DCF);	// @ (0xFB9 * 8 + 7)
#define                                 P1M1_bit            _BIT_ACCESS(CCP1CON,7)
// ECCP1DEL<P1RSEN>
extern volatile __bit                   P1RSEN              __at(0x7DE7);	// @ (0xFBC * 8 + 7)
#define                                 P1RSEN_bit          _BIT_ACCESS(ECCP1DEL,7)
// ECCP2DEL<P2DC0>
extern volatile __bit                   P2DC0               __at(0x7A88);	// @ (0xF51 * 8 + 0)
#define                                 P2DC0_bit           _BIT_ACCESS(ECCP2DEL,0)
// PSTR2CON<P2DC02>
extern volatile __bit                   P2DC02              __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 P2DC02_bit          _BIT_ACCESS(PSTR2CON,0)
// PSTR2CON<P2DC0CON>
extern volatile __bit                   P2DC0CON            __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 P2DC0CON_bit        _BIT_ACCESS(PSTR2CON,0)
// ECCP2DEL<P2DC1>
extern volatile __bit                   P2DC1               __at(0x7A89);	// @ (0xF51 * 8 + 1)
#define                                 P2DC1_bit           _BIT_ACCESS(ECCP2DEL,1)
// PSTR2CON<P2DC12>
extern volatile __bit                   P2DC12              __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 P2DC12_bit          _BIT_ACCESS(PSTR2CON,1)
// PSTR2CON<P2DC1CON>
extern volatile __bit                   P2DC1CON            __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 P2DC1CON_bit        _BIT_ACCESS(PSTR2CON,1)
// ECCP2DEL<P2DC2>
extern volatile __bit                   P2DC2               __at(0x7A8A);	// @ (0xF51 * 8 + 2)
#define                                 P2DC2_bit           _BIT_ACCESS(ECCP2DEL,2)
// PSTR2CON<P2DC22>
extern volatile __bit                   P2DC22              __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 P2DC22_bit          _BIT_ACCESS(PSTR2CON,2)
// PSTR2CON<P2DC2CON>
extern volatile __bit                   P2DC2CON            __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 P2DC2CON_bit        _BIT_ACCESS(PSTR2CON,2)
// ECCP2DEL<P2DC3>
extern volatile __bit                   P2DC3               __at(0x7A8B);	// @ (0xF51 * 8 + 3)
#define                                 P2DC3_bit           _BIT_ACCESS(ECCP2DEL,3)
// PSTR2CON<P2DC32>
extern volatile __bit                   P2DC32              __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 P2DC32_bit          _BIT_ACCESS(PSTR2CON,3)
// PSTR2CON<P2DC3CON>
extern volatile __bit                   P2DC3CON            __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 P2DC3CON_bit        _BIT_ACCESS(PSTR2CON,3)
// ECCP2DEL<P2DC4>
extern volatile __bit                   P2DC4               __at(0x7A8C);	// @ (0xF51 * 8 + 4)
#define                                 P2DC4_bit           _BIT_ACCESS(ECCP2DEL,4)
// PSTR2CON<P2DC42>
extern volatile __bit                   P2DC42              __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 P2DC42_bit          _BIT_ACCESS(PSTR2CON,4)
// PSTR2CON<P2DC4CON>
extern volatile __bit                   P2DC4CON            __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 P2DC4CON_bit        _BIT_ACCESS(PSTR2CON,4)
// ECCP2DEL<P2DC5>
extern volatile __bit                   P2DC5               __at(0x7A8D);	// @ (0xF51 * 8 + 5)
#define                                 P2DC5_bit           _BIT_ACCESS(ECCP2DEL,5)
// ECCP2DEL<P2DC6>
extern volatile __bit                   P2DC6               __at(0x7A8E);	// @ (0xF51 * 8 + 6)
#define                                 P2DC6_bit           _BIT_ACCESS(ECCP2DEL,6)
// PSTR2CON<P2DC62>
extern volatile __bit                   P2DC62              __at(0x78E6);	// @ (0xF1C * 8 + 6)
#define                                 P2DC62_bit          _BIT_ACCESS(PSTR2CON,6)
// PSTR2CON<P2DC6CON>
extern volatile __bit                   P2DC6CON            __at(0x78E6);	// @ (0xF1C * 8 + 6)
#define                                 P2DC6CON_bit        _BIT_ACCESS(PSTR2CON,6)
// CCP2CON<P2M0>
extern volatile __bit                   P2M0                __at(0x7A76);	// @ (0xF4E * 8 + 6)
#define                                 P2M0_bit            _BIT_ACCESS(CCP2CON,6)
// CCP2CON<P2M1>
extern volatile __bit                   P2M1                __at(0x7A77);	// @ (0xF4E * 8 + 7)
#define                                 P2M1_bit            _BIT_ACCESS(CCP2CON,7)
// ECCP2DEL<P2RSEN>
extern volatile __bit                   P2RSEN              __at(0x7A8F);	// @ (0xF51 * 8 + 7)
#define                                 P2RSEN_bit          _BIT_ACCESS(ECCP2DEL,7)
// ECCP3DEL<P3DC0>
extern volatile __bit                   P3DC0               __at(0x7A60);	// @ (0xF4C * 8 + 0)
#define                                 P3DC0_bit           _BIT_ACCESS(ECCP3DEL,0)
// PSTR3CON<P3DC02>
extern volatile __bit                   P3DC02              __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 P3DC02_bit          _BIT_ACCESS(PSTR3CON,0)
// PSTR3CON<P3DC0CON>
extern volatile __bit                   P3DC0CON            __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 P3DC0CON_bit        _BIT_ACCESS(PSTR3CON,0)
// ECCP3DEL<P3DC1>
extern volatile __bit                   P3DC1               __at(0x7A61);	// @ (0xF4C * 8 + 1)
#define                                 P3DC1_bit           _BIT_ACCESS(ECCP3DEL,1)
// PSTR3CON<P3DC12>
extern volatile __bit                   P3DC12              __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 P3DC12_bit          _BIT_ACCESS(PSTR3CON,1)
// PSTR3CON<P3DC1CON>
extern volatile __bit                   P3DC1CON            __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 P3DC1CON_bit        _BIT_ACCESS(PSTR3CON,1)
// ECCP3DEL<P3DC2>
extern volatile __bit                   P3DC2               __at(0x7A62);	// @ (0xF4C * 8 + 2)
#define                                 P3DC2_bit           _BIT_ACCESS(ECCP3DEL,2)
// PSTR3CON<P3DC22>
extern volatile __bit                   P3DC22              __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 P3DC22_bit          _BIT_ACCESS(PSTR3CON,2)
// PSTR3CON<P3DC2CON>
extern volatile __bit                   P3DC2CON            __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 P3DC2CON_bit        _BIT_ACCESS(PSTR3CON,2)
// ECCP3DEL<P3DC3>
extern volatile __bit                   P3DC3               __at(0x7A63);	// @ (0xF4C * 8 + 3)
#define                                 P3DC3_bit           _BIT_ACCESS(ECCP3DEL,3)
// PSTR3CON<P3DC32>
extern volatile __bit                   P3DC32              __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 P3DC32_bit          _BIT_ACCESS(PSTR3CON,3)
// PSTR3CON<P3DC3CON>
extern volatile __bit                   P3DC3CON            __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 P3DC3CON_bit        _BIT_ACCESS(PSTR3CON,3)
// ECCP3DEL<P3DC4>
extern volatile __bit                   P3DC4               __at(0x7A64);	// @ (0xF4C * 8 + 4)
#define                                 P3DC4_bit           _BIT_ACCESS(ECCP3DEL,4)
// PSTR3CON<P3DC42>
extern volatile __bit                   P3DC42              __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 P3DC42_bit          _BIT_ACCESS(PSTR3CON,4)
// PSTR3CON<P3DC4CON>
extern volatile __bit                   P3DC4CON            __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 P3DC4CON_bit        _BIT_ACCESS(PSTR3CON,4)
// ECCP3DEL<P3DC5>
extern volatile __bit                   P3DC5               __at(0x7A65);	// @ (0xF4C * 8 + 5)
#define                                 P3DC5_bit           _BIT_ACCESS(ECCP3DEL,5)
// ECCP3DEL<P3DC6>
extern volatile __bit                   P3DC6               __at(0x7A66);	// @ (0xF4C * 8 + 6)
#define                                 P3DC6_bit           _BIT_ACCESS(ECCP3DEL,6)
// PSTR3CON<P3DC62>
extern volatile __bit                   P3DC62              __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 P3DC62_bit          _BIT_ACCESS(PSTR3CON,6)
// PSTR3CON<P3DC6CON>
extern volatile __bit                   P3DC6CON            __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 P3DC6CON_bit        _BIT_ACCESS(PSTR3CON,6)
// CCP3CON<P3M0>
extern volatile __bit                   P3M0                __at(0x7A4E);	// @ (0xF49 * 8 + 6)
#define                                 P3M0_bit            _BIT_ACCESS(CCP3CON,6)
// CCP3CON<P3M1>
extern volatile __bit                   P3M1                __at(0x7A4F);	// @ (0xF49 * 8 + 7)
#define                                 P3M1_bit            _BIT_ACCESS(CCP3CON,7)
// ECCP3DEL<P3RSEN>
extern volatile __bit                   P3RSEN              __at(0x7A67);	// @ (0xF4C * 8 + 7)
#define                                 P3RSEN_bit          _BIT_ACCESS(ECCP3DEL,7)
// PORTC<PA1>
extern volatile __bit                   PA1                 __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 PA1_bit             _BIT_ACCESS(PORTC,2)
// PORTC<PA2>
extern volatile __bit                   PA2                 __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 PA2_bit             _BIT_ACCESS(PORTC,1)
// PORTE<PA2E>
extern volatile __bit                   PA2E                __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 PA2E_bit            _BIT_ACCESS(PORTE,7)
// PORTE<PB1E>
extern volatile __bit                   PB1E                __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 PB1E_bit            _BIT_ACCESS(PORTE,6)
// PORTE<PB2>
extern volatile __bit                   PB2                 __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 PB2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<PB3E>
extern volatile __bit                   PB3E                __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 PB3E_bit            _BIT_ACCESS(PORTE,4)
// RPINR46_47<PBIO0R0>
extern volatile __bit                   PBIO0R0             __at(0x7208);	// @ (0xE41 * 8 + 0)
#define                                 PBIO0R0_bit         _BIT_ACCESS(RPINR46_47,0)
// RPINR46_47<PBIO0R1>
extern volatile __bit                   PBIO0R1             __at(0x7209);	// @ (0xE41 * 8 + 1)
#define                                 PBIO0R1_bit         _BIT_ACCESS(RPINR46_47,1)
// RPINR46_47<PBIO0R2>
extern volatile __bit                   PBIO0R2             __at(0x720A);	// @ (0xE41 * 8 + 2)
#define                                 PBIO0R2_bit         _BIT_ACCESS(RPINR46_47,2)
// RPINR46_47<PBIO0R3>
extern volatile __bit                   PBIO0R3             __at(0x720B);	// @ (0xE41 * 8 + 3)
#define                                 PBIO0R3_bit         _BIT_ACCESS(RPINR46_47,3)
// RPINR46_47<PBIO1R0>
