MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J94/mcu.h
#define                                 RC4IF_bit           _BIT_ACCESS(PIR6,7)
// IPR6<RC4IP>
extern volatile __bit                   RC4IP               __at(0x7D4F);	// @ (0xFA9 * 8 + 7)
#define                                 RC4IP_bit           _BIT_ACCESS(IPR6,7)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// RCSTA1<RC8_9>
extern volatile __bit                   RC8_9               __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 RC8_9_bit           _BIT_ACCESS(RCSTA1,6)
// RCSTA1<RC9>
extern volatile __bit                   RC9                 __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 RC9_bit             _BIT_ACCESS(RCSTA1,6)
// RCSTA2<RC92>
extern volatile __bit                   RC92                __at(0x799E);	// @ (0xF33 * 8 + 6)
#define                                 RC92_bit            _BIT_ACCESS(RCSTA2,6)
// RCSTA3<RC93>
extern volatile __bit                   RC93                __at(0x797E);	// @ (0xF2F * 8 + 6)
#define                                 RC93_bit            _BIT_ACCESS(RCSTA3,6)
// RCSTA4<RC94>
extern volatile __bit                   RC94                __at(0x77FE);	// @ (0xEFF * 8 + 6)
#define                                 RC94_bit            _BIT_ACCESS(RCSTA4,6)
// RCSTA1<RCD8>
extern volatile __bit                   RCD8                __at(0x7D58);	// @ (0xFAB * 8 + 0)
#define                                 RCD8_bit            _BIT_ACCESS(RCSTA1,0)
// RCSTA2<RCD82>
extern volatile __bit                   RCD82               __at(0x7998);	// @ (0xF33 * 8 + 0)
#define                                 RCD82_bit           _BIT_ACCESS(RCSTA2,0)
// RCSTA3<RCD83>
extern volatile __bit                   RCD83               __at(0x7978);	// @ (0xF2F * 8 + 0)
#define                                 RCD83_bit           _BIT_ACCESS(RCSTA3,0)
// RCSTA4<RCD84>
extern volatile __bit                   RCD84               __at(0x77F8);	// @ (0xEFF * 8 + 0)
#define                                 RCD84_bit           _BIT_ACCESS(RCSTA4,0)
// SSP1CON2<RCEN1>
extern volatile __bit                   RCEN1               __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 RCEN1_bit           _BIT_ACCESS(SSP1CON2,3)
// SSP2CON2<RCEN2>
extern volatile __bit                   RCEN2               __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 RCEN2_bit           _BIT_ACCESS(SSP2CON2,3)
// BAUDCON1<RCIDL1>
extern volatile __bit                   RCIDL1              __at(0x7B3E);	// @ (0xF67 * 8 + 6)
#define                                 RCIDL1_bit          _BIT_ACCESS(BAUDCON1,6)
// BAUDCON2<RCIDL2>
extern volatile __bit                   RCIDL2              __at(0x798E);	// @ (0xF31 * 8 + 6)
#define                                 RCIDL2_bit          _BIT_ACCESS(BAUDCON2,6)
// BAUDCON3<RCIDL3>
extern volatile __bit                   RCIDL3              __at(0x796E);	// @ (0xF2D * 8 + 6)
#define                                 RCIDL3_bit          _BIT_ACCESS(BAUDCON3,6)
// BAUDCON4<RCIDL4>
extern volatile __bit                   RCIDL4              __at(0x77EE);	// @ (0xEFD * 8 + 6)
#define                                 RCIDL4_bit          _BIT_ACCESS(BAUDCON4,6)
// BAUDCON1<RCMT>
extern volatile __bit                   RCMT                __at(0x7B3E);	// @ (0xF67 * 8 + 6)
#define                                 RCMT_bit            _BIT_ACCESS(BAUDCON1,6)
// BAUDCON1<RCMT1>
extern volatile __bit                   RCMT1               __at(0x7B3E);	// @ (0xF67 * 8 + 6)
#define                                 RCMT1_bit           _BIT_ACCESS(BAUDCON1,6)
// BAUDCON2<RCMT2>
extern volatile __bit                   RCMT2               __at(0x798E);	// @ (0xF31 * 8 + 6)
#define                                 RCMT2_bit           _BIT_ACCESS(BAUDCON2,6)
// BAUDCON3<RCMT3>
extern volatile __bit                   RCMT3               __at(0x796E);	// @ (0xF2D * 8 + 6)
#define                                 RCMT3_bit           _BIT_ACCESS(BAUDCON3,6)
// BAUDCON4<RCMT4>
extern volatile __bit                   RCMT4               __at(0x77EE);	// @ (0xEFD * 8 + 6)
#define                                 RCMT4_bit           _BIT_ACCESS(BAUDCON4,6)
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// T1CON<RD161>
extern volatile __bit                   RD161               __at(0x7E69);	// @ (0xFCD * 8 + 1)
#define                                 RD161_bit           _BIT_ACCESS(T1CON,1)
// T3CON<RD163>
extern volatile __bit                   RD163               __at(0x7D89);	// @ (0xFB1 * 8 + 1)
#define                                 RD163_bit           _BIT_ACCESS(T3CON,1)
// T5CON<RD165>
extern volatile __bit                   RD165               __at(0x78A1);	// @ (0xF14 * 8 + 1)
#define                                 RD165_bit           _BIT_ACCESS(T5CON,1)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<RD7>
extern volatile __bit                   RD7                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// PORTE<RDE>
extern volatile __bit                   RDE                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 RDE_bit             _BIT_ACCESS(PORTE,0)
// PADCFG1<RDPU>
extern volatile __bit                   RDPU                __at(0x7AA7);	// @ (0xF54 * 8 + 7)
#define                                 RDPU_bit            _BIT_ACCESS(PADCFG1,7)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// PORTE<RE4>
extern volatile __bit                   RE4                 __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 RE4_bit             _BIT_ACCESS(PORTE,4)
// PORTE<RE5>
extern volatile __bit                   RE5                 __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 RE5_bit             _BIT_ACCESS(PORTE,5)
// PORTE<RE6>
extern volatile __bit                   RE6                 __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 RE6_bit             _BIT_ACCESS(PORTE,6)
// PORTE<RE7>
extern volatile __bit                   RE7                 __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 RE7_bit             _BIT_ACCESS(PORTE,7)
// SSP1STAT<READ_WRITE1>
extern volatile __bit                   READ_WRITE1         __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 READ_WRITE1_bit     _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<READ_WRITE2>
extern volatile __bit                   READ_WRITE2         __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 READ_WRITE2_bit     _BIT_ACCESS(SSP2STAT,2)
// PMD3<REFO1MD>
extern volatile __bit                   REFO1MD             __at(0x7789);	// @ (0xEF1 * 8 + 1)
#define                                 REFO1MD_bit         _BIT_ACCESS(PMD3,1)
// PMD3<REFO2MD>
extern volatile __bit                   REFO2MD             __at(0x7788);	// @ (0xEF1 * 8 + 0)
#define                                 REFO2MD_bit         _BIT_ACCESS(PMD3,0)
// DSCONL<RELEASE>
extern volatile __bit                   RELEASE             __at(0x7940);	// @ (0xF28 * 8 + 0)
#define                                 RELEASE_bit         _BIT_ACCESS(DSCONL,0)
// PADCFG1<REPU>
extern volatile __bit                   REPU                __at(0x7AA6);	// @ (0xF54 * 8 + 6)
#define                                 REPU_bit            _BIT_ACCESS(PADCFG1,6)
// UCON<RESUME>
extern volatile __bit                   RESUME              __at(0x7BAA);	// @ (0xF75 * 8 + 2)
#define                                 RESUME_bit          _BIT_ACCESS(UCON,2)
// PORTF<RF2>
extern volatile __bit                   RF2                 __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 RF2_bit             _BIT_ACCESS(PORTF,2)
// PORTF<RF3>
extern volatile __bit                   RF3                 __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 RF3_bit             _BIT_ACCESS(PORTF,3)
// PORTF<RF4>
extern volatile __bit                   RF4                 __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 RF4_bit             _BIT_ACCESS(PORTF,4)
// PORTF<RF5>
extern volatile __bit                   RF5                 __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 RF5_bit             _BIT_ACCESS(PORTF,5)
// PORTF<RF6>
extern volatile __bit                   RF6                 __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 RF6_bit             _BIT_ACCESS(PORTF,6)
// PORTF<RF7>
extern volatile __bit                   RF7                 __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 RF7_bit             _BIT_ACCESS(PORTF,7)
// PADCFG1<RFPU>
extern volatile __bit                   RFPU                __at(0x7AA5);	// @ (0xF54 * 8 + 5)
#define                                 RFPU_bit            _BIT_ACCESS(PADCFG1,5)
// PORTG<RG0>
extern volatile __bit                   RG0                 __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 RG0_bit             _BIT_ACCESS(PORTG,0)
// PORTG<RG1>
extern volatile __bit                   RG1                 __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 RG1_bit             _BIT_ACCESS(PORTG,1)
// PORTG<RG2>
extern volatile __bit                   RG2                 __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 RG2_bit             _BIT_ACCESS(PORTG,2)
// PORTG<RG3>
extern volatile __bit                   RG3                 __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 RG3_bit             _BIT_ACCESS(PORTG,3)
// PORTG<RG4>
extern volatile __bit                   RG4                 __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 RG4_bit             _BIT_ACCESS(PORTG,4)
// PADCFG1<RGPU>
extern volatile __bit                   RGPU                __at(0x7AA4);	// @ (0xF54 * 8 + 4)
#define                                 RGPU_bit            _BIT_ACCESS(PADCFG1,4)
// PADCFG1<RHPU>
extern volatile __bit                   RHPU                __at(0x7AA3);	// @ (0xF54 * 8 + 3)
#define                                 RHPU_bit            _BIT_ACCESS(PADCFG1,3)
// RCON<RI>
extern volatile __bit                   RI                  __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 RI_bit              _BIT_ACCESS(RCON,4)
// PADCFG1<RKPU>
extern volatile __bit                   RKPU                __at(0x7AA1);	// @ (0xF54 * 8 + 1)
#define                                 RKPU_bit            _BIT_ACCESS(PADCFG1,1)
// PADCFG1<RLPU>
extern volatile __bit                   RLPU                __at(0x7AA0);	// @ (0xF54 * 8 + 0)
#define                                 RLPU_bit            _BIT_ACCESS(PADCFG1,0)
// RPOR0_1<RPO0R0>
extern volatile __bit                   RPO0R0              __at(0x7090);	// @ (0xE12 * 8 + 0)
#define                                 RPO0R0_bit          _BIT_ACCESS(RPOR0_1,0)
// RPOR0_1<RPO0R1>
extern volatile __bit                   RPO0R1              __at(0x7091);	// @ (0xE12 * 8 + 1)
#define                                 RPO0R1_bit          _BIT_ACCESS(RPOR0_1,1)
// RPOR0_1<RPO0R2>
extern volatile __bit                   RPO0R2              __at(0x7092);	// @ (0xE12 * 8 + 2)
#define                                 RPO0R2_bit          _BIT_ACCESS(RPOR0_1,2)
// RPOR0_1<RPO0R3>
extern volatile __bit                   RPO0R3              __at(0x7093);	// @ (0xE12 * 8 + 3)
#define                                 RPO0R3_bit          _BIT_ACCESS(RPOR0_1,3)
// RPOR10_11<RPO10R0>
extern volatile __bit                   RPO10R0             __at(0x70B8);	// @ (0xE17 * 8 + 0)
#define                                 RPO10R0_bit         _BIT_ACCESS(RPOR10_11,0)
// RPOR10_11<RPO10R1>
extern volatile __bit                   RPO10R1             __at(0x70B9);	// @ (0xE17 * 8 + 1)
#define                                 RPO10R1_bit         _BIT_ACCESS(RPOR10_11,1)
// RPOR10_11<RPO10R2>
extern volatile __bit                   RPO10R2             __at(0x70BA);	// @ (0xE17 * 8 + 2)
#define                                 RPO10R2_bit         _BIT_ACCESS(RPOR10_11,2)
// RPOR10_11<RPO10R3>
extern volatile __bit                   RPO10R3             __at(0x70BB);	// @ (0xE17 * 8 + 3)
#define                                 RPO10R3_bit         _BIT_ACCESS(RPOR10_11,3)
// RPOR10_11<RPO11R0>
extern volatile __bit                   RPO11R0             __at(0x70BC);	// @ (0xE17 * 8 + 4)
#define                                 RPO11R0_bit         _BIT_ACCESS(RPOR10_11,4)
// RPOR10_11<RPO11R1>
extern volatile __bit                   RPO11R1             __at(0x70BD);	// @ (0xE17 * 8 + 5)
#define                                 RPO11R1_bit         _BIT_ACCESS(RPOR10_11,5)
// RPOR10_11<RPO11R2>
extern volatile __bit                   RPO11R2             __at(0x70BE);	// @ (0xE17 * 8 + 6)
#define                                 RPO11R2_bit         _BIT_ACCESS(RPOR10_11,6)
// RPOR10_11<RPO11R3>
extern volatile __bit                   RPO11R3             __at(0x70BF);	// @ (0xE17 * 8 + 7)
#define                                 RPO11R3_bit         _BIT_ACCESS(RPOR10_11,7)
// RPOR12_13<RPO12R0>
extern volatile __bit                   RPO12R0             __at(0x70C0);	// @ (0xE18 * 8 + 0)
#define                                 RPO12R0_bit         _BIT_ACCESS(RPOR12_13,0)
// RPOR12_13<RPO12R1>
extern volatile __bit                   RPO12R1             __at(0x70C1);	// @ (0xE18 * 8 + 1)
#define                                 RPO12R1_bit         _BIT_ACCESS(RPOR12_13,1)
// RPOR12_13<RPO12R2>
extern volatile __bit                   RPO12R2             __at(0x70C2);	// @ (0xE18 * 8 + 2)
#define                                 RPO12R2_bit         _BIT_ACCESS(RPOR12_13,2)
// RPOR12_13<RPO12R3>
extern volatile __bit                   RPO12R3             __at(0x70C3);	// @ (0xE18 * 8 + 3)
#define                                 RPO12R3_bit         _BIT_ACCESS(RPOR12_13,3)
// RPOR12_13<RPO13R0>
extern volatile __bit                   RPO13R0             __at(0x70C4);	// @ (0xE18 * 8 + 4)
#define                                 RPO13R0_bit         _BIT_ACCESS(RPOR12_13,4)
// RPOR12_13<RPO13R1>
extern volatile __bit                   RPO13R1             __at(0x70C5);	// @ (0xE18 * 8 + 5)
#define                                 RPO13R1_bit         _BIT_ACCESS(RPOR12_13,5)
// RPOR12_13<RPO13R2>
extern volatile __bit                   RPO13R2             __at(0x70C6);	// @ (0xE18 * 8 + 6)
#define                                 RPO13R2_bit         _BIT_ACCESS(RPOR12_13,6)
// RPOR12_13<RPO13R3>
extern volatile __bit                   RPO13R3             __at(0x70C7);	// @ (0xE18 * 8 + 7)
#define                                 RPO13R3_bit         _BIT_ACCESS(RPOR12_13,7)
// RPOR14_15<RPO14R0>
extern volatile __bit                   RPO14R0             __at(0x70C8);	// @ (0xE19 * 8 + 0)
#define                                 RPO14R0_bit         _BIT_ACCESS(RPOR14_15,0)
// RPOR14_15<RPO14R1>
extern volatile __bit                   RPO14R1             __at(0x70C9);	// @ (0xE19 * 8 + 1)
#define                                 RPO14R1_bit         _BIT_ACCESS(RPOR14_15,1)
// RPOR14_15<RPO14R2>
extern volatile __bit                   RPO14R2             __at(0x70CA);	// @ (0xE19 * 8 + 2)
#define                                 RPO14R2_bit         _BIT_ACCESS(RPOR14_15,2)
// RPOR14_15<RPO14R3>
extern volatile __bit                   RPO14R3             __at(0x70CB);	// @ (0xE19 * 8 + 3)
#define                                 RPO14R3_bit         _BIT_ACCESS(RPOR14_15,3)
// RPOR14_15<RPO15R0>
extern volatile __bit                   RPO15R0             __at(0x70CC);	// @ (0xE19 * 8 + 4)
#define                                 RPO15R0_bit         _BIT_ACCESS(RPOR14_15,4)
// RPOR14_15<RPO15R1>
extern volatile __bit                   RPO15R1             __at(0x70CD);	// @ (0xE19 * 8 + 5)
#define                                 RPO15R1_bit         _BIT_ACCESS(RPOR14_15,5)
// RPOR14_15<RPO15R2>
extern volatile __bit                   RPO15R2             __at(0x70CE);	// @ (0xE19 * 8 + 6)
#define                                 RPO15R2_bit         _BIT_ACCESS(RPOR14_15,6)
// RPOR14_15<RPO15R3>
extern volatile __bit                   RPO15R3             __at(0x70CF);	// @ (0xE19 * 8 + 7)
#define                                 RPO15R3_bit         _BIT_ACCESS(RPOR14_15,7)
// RPOR16_17<RPO16R0>
extern volatile __bit                   RPO16R0             __at(0x70D0);	// @ (0xE1A * 8 + 0)
#define                                 RPO16R0_bit         _BIT_ACCESS(RPOR16_17,0)
// RPOR16_17<RPO16R1>
extern volatile __bit                   RPO16R1             __at(0x70D1);	// @ (0xE1A * 8 + 1)
#define                                 RPO16R1_bit         _BIT_ACCESS(RPOR16_17,1)
// RPOR16_17<RPO16R2>
extern volatile __bit                   RPO16R2             __at(0x70D2);	// @ (0xE1A * 8 + 2)
#define                                 RPO16R2_bit         _BIT_ACCESS(RPOR16_17,2)
// RPOR16_17<RPO16R3>
extern volatile __bit                   RPO16R3             __at(0x70D3);	// @ (0xE1A * 8 + 3)
#define                                 RPO16R3_bit         _BIT_ACCESS(RPOR16_17,3)
// RPOR16_17<RPO17R0>
extern volatile __bit                   RPO17R0             __at(0x70D4);	// @ (0xE1A * 8 + 4)
#define                                 RPO17R0_bit         _BIT_ACCESS(RPOR16_17,4)
// RPOR16_17<RPO17R1>
extern volatile __bit                   RPO17R1             __at(0x70D5);	// @ (0xE1A * 8 + 5)
#define                                 RPO17R1_bit         _BIT_ACCESS(RPOR16_17,5)
// RPOR16_17<RPO17R2>
extern volatile __bit                   RPO17R2             __at(0x70D6);	// @ (0xE1A * 8 + 6)
#define                                 RPO17R2_bit         _BIT_ACCESS(RPOR16_17,6)
// RPOR16_17<RPO17R3>
extern volatile __bit                   RPO17R3             __at(0x70D7);	// @ (0xE1A * 8 + 7)
#define                                 RPO17R3_bit         _BIT_ACCESS(RPOR16_17,7)
// RPOR18_19<RPO18R0>
extern volatile __bit                   RPO18R0             __at(0x70D8);	// @ (0xE1B * 8 + 0)
#define                                 RPO18R0_bit         _BIT_ACCESS(RPOR18_19,0)
// RPOR18_19<RPO18R1>
extern volatile __bit                   RPO18R1             __at(0x70D9);	// @ (0xE1B * 8 + 1)
#define                                 RPO18R1_bit         _BIT_ACCESS(RPOR18_19,1)
// RPOR18_19<RPO18R2>
extern volatile __bit                   RPO18R2             __at(0x70DA);	// @ (0xE1B * 8 + 2)
#define                                 RPO18R2_bit         _BIT_ACCESS(RPOR18_19,2)
// RPOR18_19<RPO18R3>
extern volatile __bit                   RPO18R3             __at(0x70DB);	// @ (0xE1B * 8 + 3)
#define                                 RPO18R3_bit         _BIT_ACCESS(RPOR18_19,3)
// RPOR18_19<RPO19R0>
extern volatile __bit                   RPO19R0             __at(0x70DC);	// @ (0xE1B * 8 + 4)
#define                                 RPO19R0_bit         _BIT_ACCESS(RPOR18_19,4)
// RPOR18_19<RPO19R1>
extern volatile __bit                   RPO19R1             __at(0x70DD);	// @ (0xE1B * 8 + 5)
#define                                 RPO19R1_bit         _BIT_ACCESS(RPOR18_19,5)
// RPOR18_19<RPO19R2>
extern volatile __bit                   RPO19R2             __at(0x70DE);	// @ (0xE1B * 8 + 6)
#define                                 RPO19R2_bit         _BIT_ACCESS(RPOR18_19,6)
// RPOR18_19<RPO19R3>
extern volatile __bit                   RPO19R3             __at(0x70DF);	// @ (0xE1B * 8 + 7)
#define                                 RPO19R3_bit         _BIT_ACCESS(RPOR18_19,7)
// RPOR0_1<RPO1R0>
extern volatile __bit                   RPO1R0              __at(0x7094);	// @ (0xE12 * 8 + 4)
#define                                 RPO1R0_bit          _BIT_ACCESS(RPOR0_1,4)
// RPOR0_1<RPO1R1>
extern volatile __bit                   RPO1R1              __at(0x7095);	// @ (0xE12 * 8 + 5)
#define                                 RPO1R1_bit          _BIT_ACCESS(RPOR0_1,5)
// RPOR0_1<RPO1R2>
extern volatile __bit                   RPO1R2              __at(0x7096);	// @ (0xE12 * 8 + 6)
#define                                 RPO1R2_bit          _BIT_ACCESS(RPOR0_1,6)
// RPOR0_1<RPO1R3>
extern volatile __bit                   RPO1R3              __at(0x7097);	// @ (0xE12 * 8 + 7)
#define                                 RPO1R3_bit          _BIT_ACCESS(RPOR0_1,7)
// RPOR20_21<RPO20R0>
extern volatile __bit                   RPO20R0             __at(0x70E0);	// @ (0xE1C * 8 + 0)
#define                                 RPO20R0_bit         _BIT_ACCESS(RPOR20_21,0)
// RPOR20_21<RPO20R1>
extern volatile __bit                   RPO20R1             __at(0x70E1);	// @ (0xE1C * 8 + 1)
#define                                 RPO20R1_bit         _BIT_ACCESS(RPOR20_21,1)
// RPOR20_21<RPO20R2>
extern volatile __bit                   RPO20R2             __at(0x70E2);	// @ (0xE1C * 8 + 2)
#define                                 RPO20R2_bit         _BIT_ACCESS(RPOR20_21,2)
// RPOR20_21<RPO20R3>
extern volatile __bit                   RPO20R3             __at(0x70E3);	// @ (0xE1C * 8 + 3)
#define                                 RPO20R3_bit         _BIT_ACCESS(RPOR20_21,3)
// RPOR20_21<RPO21R0>
extern volatile __bit                   RPO21R0             __at(0x70E4);	// @ (0xE1C * 8 + 4)
