MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J94/mcu.h
#define                                 RPO21R0_bit         _BIT_ACCESS(RPOR20_21,4)
// RPOR20_21<RPO21R1>
extern volatile __bit                   RPO21R1             __at(0x70E5);	// @ (0xE1C * 8 + 5)
#define                                 RPO21R1_bit         _BIT_ACCESS(RPOR20_21,5)
// RPOR20_21<RPO21R2>
extern volatile __bit                   RPO21R2             __at(0x70E6);	// @ (0xE1C * 8 + 6)
#define                                 RPO21R2_bit         _BIT_ACCESS(RPOR20_21,6)
// RPOR20_21<RPO21R3>
extern volatile __bit                   RPO21R3             __at(0x70E7);	// @ (0xE1C * 8 + 7)
#define                                 RPO21R3_bit         _BIT_ACCESS(RPOR20_21,7)
// RPOR22_23<RPO22R0>
extern volatile __bit                   RPO22R0             __at(0x70E8);	// @ (0xE1D * 8 + 0)
#define                                 RPO22R0_bit         _BIT_ACCESS(RPOR22_23,0)
// RPOR22_23<RPO22R1>
extern volatile __bit                   RPO22R1             __at(0x70E9);	// @ (0xE1D * 8 + 1)
#define                                 RPO22R1_bit         _BIT_ACCESS(RPOR22_23,1)
// RPOR22_23<RPO22R2>
extern volatile __bit                   RPO22R2             __at(0x70EA);	// @ (0xE1D * 8 + 2)
#define                                 RPO22R2_bit         _BIT_ACCESS(RPOR22_23,2)
// RPOR22_23<RPO22R3>
extern volatile __bit                   RPO22R3             __at(0x70EB);	// @ (0xE1D * 8 + 3)
#define                                 RPO22R3_bit         _BIT_ACCESS(RPOR22_23,3)
// RPOR22_23<RPO23R0>
extern volatile __bit                   RPO23R0             __at(0x70EC);	// @ (0xE1D * 8 + 4)
#define                                 RPO23R0_bit         _BIT_ACCESS(RPOR22_23,4)
// RPOR22_23<RPO23R1>
extern volatile __bit                   RPO23R1             __at(0x70ED);	// @ (0xE1D * 8 + 5)
#define                                 RPO23R1_bit         _BIT_ACCESS(RPOR22_23,5)
// RPOR22_23<RPO23R2>
extern volatile __bit                   RPO23R2             __at(0x70EE);	// @ (0xE1D * 8 + 6)
#define                                 RPO23R2_bit         _BIT_ACCESS(RPOR22_23,6)
// RPOR22_23<RPO23R3>
extern volatile __bit                   RPO23R3             __at(0x70EF);	// @ (0xE1D * 8 + 7)
#define                                 RPO23R3_bit         _BIT_ACCESS(RPOR22_23,7)
// RPOR24_25<RPO24R0>
extern volatile __bit                   RPO24R0             __at(0x70F0);	// @ (0xE1E * 8 + 0)
#define                                 RPO24R0_bit         _BIT_ACCESS(RPOR24_25,0)
// RPOR24_25<RPO24R1>
extern volatile __bit                   RPO24R1             __at(0x70F1);	// @ (0xE1E * 8 + 1)
#define                                 RPO24R1_bit         _BIT_ACCESS(RPOR24_25,1)
// RPOR24_25<RPO24R2>
extern volatile __bit                   RPO24R2             __at(0x70F2);	// @ (0xE1E * 8 + 2)
#define                                 RPO24R2_bit         _BIT_ACCESS(RPOR24_25,2)
// RPOR24_25<RPO24R3>
extern volatile __bit                   RPO24R3             __at(0x70F3);	// @ (0xE1E * 8 + 3)
#define                                 RPO24R3_bit         _BIT_ACCESS(RPOR24_25,3)
// RPOR24_25<RPO25R0>
extern volatile __bit                   RPO25R0             __at(0x70F4);	// @ (0xE1E * 8 + 4)
#define                                 RPO25R0_bit         _BIT_ACCESS(RPOR24_25,4)
// RPOR24_25<RPO25R1>
extern volatile __bit                   RPO25R1             __at(0x70F5);	// @ (0xE1E * 8 + 5)
#define                                 RPO25R1_bit         _BIT_ACCESS(RPOR24_25,5)
// RPOR24_25<RPO25R2>
extern volatile __bit                   RPO25R2             __at(0x70F6);	// @ (0xE1E * 8 + 6)
#define                                 RPO25R2_bit         _BIT_ACCESS(RPOR24_25,6)
// RPOR24_25<RPO25R3>
extern volatile __bit                   RPO25R3             __at(0x70F7);	// @ (0xE1E * 8 + 7)
#define                                 RPO25R3_bit         _BIT_ACCESS(RPOR24_25,7)
// RPOR26_27<RPO26R0>
extern volatile __bit                   RPO26R0             __at(0x70F8);	// @ (0xE1F * 8 + 0)
#define                                 RPO26R0_bit         _BIT_ACCESS(RPOR26_27,0)
// RPOR26_27<RPO26R1>
extern volatile __bit                   RPO26R1             __at(0x70F9);	// @ (0xE1F * 8 + 1)
#define                                 RPO26R1_bit         _BIT_ACCESS(RPOR26_27,1)
// RPOR26_27<RPO26R2>
extern volatile __bit                   RPO26R2             __at(0x70FA);	// @ (0xE1F * 8 + 2)
#define                                 RPO26R2_bit         _BIT_ACCESS(RPOR26_27,2)
// RPOR26_27<RPO26R3>
extern volatile __bit                   RPO26R3             __at(0x70FB);	// @ (0xE1F * 8 + 3)
#define                                 RPO26R3_bit         _BIT_ACCESS(RPOR26_27,3)
// RPOR26_27<RPO27R0>
extern volatile __bit                   RPO27R0             __at(0x70FC);	// @ (0xE1F * 8 + 4)
#define                                 RPO27R0_bit         _BIT_ACCESS(RPOR26_27,4)
// RPOR26_27<RPO27R1>
extern volatile __bit                   RPO27R1             __at(0x70FD);	// @ (0xE1F * 8 + 5)
#define                                 RPO27R1_bit         _BIT_ACCESS(RPOR26_27,5)
// RPOR26_27<RPO27R2>
extern volatile __bit                   RPO27R2             __at(0x70FE);	// @ (0xE1F * 8 + 6)
#define                                 RPO27R2_bit         _BIT_ACCESS(RPOR26_27,6)
// RPOR26_27<RPO27R3>
extern volatile __bit                   RPO27R3             __at(0x70FF);	// @ (0xE1F * 8 + 7)
#define                                 RPO27R3_bit         _BIT_ACCESS(RPOR26_27,7)
// RPOR28_29<RPO28R0>
extern volatile __bit                   RPO28R0             __at(0x7100);	// @ (0xE20 * 8 + 0)
#define                                 RPO28R0_bit         _BIT_ACCESS(RPOR28_29,0)
// RPOR28_29<RPO28R1>
extern volatile __bit                   RPO28R1             __at(0x7101);	// @ (0xE20 * 8 + 1)
#define                                 RPO28R1_bit         _BIT_ACCESS(RPOR28_29,1)
// RPOR28_29<RPO28R2>
extern volatile __bit                   RPO28R2             __at(0x7102);	// @ (0xE20 * 8 + 2)
#define                                 RPO28R2_bit         _BIT_ACCESS(RPOR28_29,2)
// RPOR28_29<RPO28R3>
extern volatile __bit                   RPO28R3             __at(0x7103);	// @ (0xE20 * 8 + 3)
#define                                 RPO28R3_bit         _BIT_ACCESS(RPOR28_29,3)
// RPOR28_29<RPO29R0>
extern volatile __bit                   RPO29R0             __at(0x7104);	// @ (0xE20 * 8 + 4)
#define                                 RPO29R0_bit         _BIT_ACCESS(RPOR28_29,4)
// RPOR28_29<RPO29R1>
extern volatile __bit                   RPO29R1             __at(0x7105);	// @ (0xE20 * 8 + 5)
#define                                 RPO29R1_bit         _BIT_ACCESS(RPOR28_29,5)
// RPOR28_29<RPO29R2>
extern volatile __bit                   RPO29R2             __at(0x7106);	// @ (0xE20 * 8 + 6)
#define                                 RPO29R2_bit         _BIT_ACCESS(RPOR28_29,6)
// RPOR28_29<RPO29R3>
extern volatile __bit                   RPO29R3             __at(0x7107);	// @ (0xE20 * 8 + 7)
#define                                 RPO29R3_bit         _BIT_ACCESS(RPOR28_29,7)
// RPOR2_3<RPO2R0>
extern volatile __bit                   RPO2R0              __at(0x7098);	// @ (0xE13 * 8 + 0)
#define                                 RPO2R0_bit          _BIT_ACCESS(RPOR2_3,0)
// RPOR2_3<RPO2R1>
extern volatile __bit                   RPO2R1              __at(0x7099);	// @ (0xE13 * 8 + 1)
#define                                 RPO2R1_bit          _BIT_ACCESS(RPOR2_3,1)
// RPOR2_3<RPO2R2>
extern volatile __bit                   RPO2R2              __at(0x709A);	// @ (0xE13 * 8 + 2)
#define                                 RPO2R2_bit          _BIT_ACCESS(RPOR2_3,2)
// RPOR2_3<RPO2R3>
extern volatile __bit                   RPO2R3              __at(0x709B);	// @ (0xE13 * 8 + 3)
#define                                 RPO2R3_bit          _BIT_ACCESS(RPOR2_3,3)
// RPOR30_31<RPO30R0>
extern volatile __bit                   RPO30R0             __at(0x7108);	// @ (0xE21 * 8 + 0)
#define                                 RPO30R0_bit         _BIT_ACCESS(RPOR30_31,0)
// RPOR30_31<RPO30R1>
extern volatile __bit                   RPO30R1             __at(0x7109);	// @ (0xE21 * 8 + 1)
#define                                 RPO30R1_bit         _BIT_ACCESS(RPOR30_31,1)
// RPOR30_31<RPO30R2>
extern volatile __bit                   RPO30R2             __at(0x710A);	// @ (0xE21 * 8 + 2)
#define                                 RPO30R2_bit         _BIT_ACCESS(RPOR30_31,2)
// RPOR30_31<RPO30R3>
extern volatile __bit                   RPO30R3             __at(0x710B);	// @ (0xE21 * 8 + 3)
#define                                 RPO30R3_bit         _BIT_ACCESS(RPOR30_31,3)
// RPOR30_31<RPO31R0>
extern volatile __bit                   RPO31R0             __at(0x710C);	// @ (0xE21 * 8 + 4)
#define                                 RPO31R0_bit         _BIT_ACCESS(RPOR30_31,4)
// RPOR30_31<RPO31R1>
extern volatile __bit                   RPO31R1             __at(0x710D);	// @ (0xE21 * 8 + 5)
#define                                 RPO31R1_bit         _BIT_ACCESS(RPOR30_31,5)
// RPOR30_31<RPO31R2>
extern volatile __bit                   RPO31R2             __at(0x710E);	// @ (0xE21 * 8 + 6)
#define                                 RPO31R2_bit         _BIT_ACCESS(RPOR30_31,6)
// RPOR30_31<RPO31R3>
extern volatile __bit                   RPO31R3             __at(0x710F);	// @ (0xE21 * 8 + 7)
#define                                 RPO31R3_bit         _BIT_ACCESS(RPOR30_31,7)
// RPOR32_33<RPO32R0>
extern volatile __bit                   RPO32R0             __at(0x7110);	// @ (0xE22 * 8 + 0)
#define                                 RPO32R0_bit         _BIT_ACCESS(RPOR32_33,0)
// RPOR32_33<RPO32R1>
extern volatile __bit                   RPO32R1             __at(0x7111);	// @ (0xE22 * 8 + 1)
#define                                 RPO32R1_bit         _BIT_ACCESS(RPOR32_33,1)
// RPOR32_33<RPO32R2>
extern volatile __bit                   RPO32R2             __at(0x7112);	// @ (0xE22 * 8 + 2)
#define                                 RPO32R2_bit         _BIT_ACCESS(RPOR32_33,2)
// RPOR32_33<RPO32R3>
extern volatile __bit                   RPO32R3             __at(0x7113);	// @ (0xE22 * 8 + 3)
#define                                 RPO32R3_bit         _BIT_ACCESS(RPOR32_33,3)
// RPOR32_33<RPO33R0>
extern volatile __bit                   RPO33R0             __at(0x7114);	// @ (0xE22 * 8 + 4)
#define                                 RPO33R0_bit         _BIT_ACCESS(RPOR32_33,4)
// RPOR32_33<RPO33R1>
extern volatile __bit                   RPO33R1             __at(0x7115);	// @ (0xE22 * 8 + 5)
#define                                 RPO33R1_bit         _BIT_ACCESS(RPOR32_33,5)
// RPOR32_33<RPO33R2>
extern volatile __bit                   RPO33R2             __at(0x7116);	// @ (0xE22 * 8 + 6)
#define                                 RPO33R2_bit         _BIT_ACCESS(RPOR32_33,6)
// RPOR32_33<RPO33R3>
extern volatile __bit                   RPO33R3             __at(0x7117);	// @ (0xE22 * 8 + 7)
#define                                 RPO33R3_bit         _BIT_ACCESS(RPOR32_33,7)
// RPOR34_35<RPO34R0>
extern volatile __bit                   RPO34R0             __at(0x7118);	// @ (0xE23 * 8 + 0)
#define                                 RPO34R0_bit         _BIT_ACCESS(RPOR34_35,0)
// RPOR34_35<RPO34R1>
extern volatile __bit                   RPO34R1             __at(0x7119);	// @ (0xE23 * 8 + 1)
#define                                 RPO34R1_bit         _BIT_ACCESS(RPOR34_35,1)
// RPOR34_35<RPO34R2>
extern volatile __bit                   RPO34R2             __at(0x711A);	// @ (0xE23 * 8 + 2)
#define                                 RPO34R2_bit         _BIT_ACCESS(RPOR34_35,2)
// RPOR34_35<RPO34R3>
extern volatile __bit                   RPO34R3             __at(0x711B);	// @ (0xE23 * 8 + 3)
#define                                 RPO34R3_bit         _BIT_ACCESS(RPOR34_35,3)
// RPOR34_35<RPO35R0>
extern volatile __bit                   RPO35R0             __at(0x711C);	// @ (0xE23 * 8 + 4)
#define                                 RPO35R0_bit         _BIT_ACCESS(RPOR34_35,4)
// RPOR34_35<RPO35R1>
extern volatile __bit                   RPO35R1             __at(0x711D);	// @ (0xE23 * 8 + 5)
#define                                 RPO35R1_bit         _BIT_ACCESS(RPOR34_35,5)
// RPOR34_35<RPO35R2>
extern volatile __bit                   RPO35R2             __at(0x711E);	// @ (0xE23 * 8 + 6)
#define                                 RPO35R2_bit         _BIT_ACCESS(RPOR34_35,6)
// RPOR34_35<RPO35R3>
extern volatile __bit                   RPO35R3             __at(0x711F);	// @ (0xE23 * 8 + 7)
#define                                 RPO35R3_bit         _BIT_ACCESS(RPOR34_35,7)
// RPOR36_37<RPO36R0>
extern volatile __bit                   RPO36R0             __at(0x7120);	// @ (0xE24 * 8 + 0)
#define                                 RPO36R0_bit         _BIT_ACCESS(RPOR36_37,0)
// RPOR36_37<RPO36R1>
extern volatile __bit                   RPO36R1             __at(0x7121);	// @ (0xE24 * 8 + 1)
#define                                 RPO36R1_bit         _BIT_ACCESS(RPOR36_37,1)
// RPOR36_37<RPO36R2>
extern volatile __bit                   RPO36R2             __at(0x7122);	// @ (0xE24 * 8 + 2)
#define                                 RPO36R2_bit         _BIT_ACCESS(RPOR36_37,2)
// RPOR36_37<RPO36R3>
extern volatile __bit                   RPO36R3             __at(0x7123);	// @ (0xE24 * 8 + 3)
#define                                 RPO36R3_bit         _BIT_ACCESS(RPOR36_37,3)
// RPOR36_37<RPO37R0>
extern volatile __bit                   RPO37R0             __at(0x7124);	// @ (0xE24 * 8 + 4)
#define                                 RPO37R0_bit         _BIT_ACCESS(RPOR36_37,4)
// RPOR36_37<RPO37R1>
extern volatile __bit                   RPO37R1             __at(0x7125);	// @ (0xE24 * 8 + 5)
#define                                 RPO37R1_bit         _BIT_ACCESS(RPOR36_37,5)
// RPOR36_37<RPO37R2>
extern volatile __bit                   RPO37R2             __at(0x7126);	// @ (0xE24 * 8 + 6)
#define                                 RPO37R2_bit         _BIT_ACCESS(RPOR36_37,6)
// RPOR36_37<RPO37R3>
extern volatile __bit                   RPO37R3             __at(0x7127);	// @ (0xE24 * 8 + 7)
#define                                 RPO37R3_bit         _BIT_ACCESS(RPOR36_37,7)
// RPOR38_39<RPO38R0>
extern volatile __bit                   RPO38R0             __at(0x7128);	// @ (0xE25 * 8 + 0)
#define                                 RPO38R0_bit         _BIT_ACCESS(RPOR38_39,0)
// RPOR38_39<RPO38R1>
extern volatile __bit                   RPO38R1             __at(0x7129);	// @ (0xE25 * 8 + 1)
#define                                 RPO38R1_bit         _BIT_ACCESS(RPOR38_39,1)
// RPOR38_39<RPO38R2>
extern volatile __bit                   RPO38R2             __at(0x712A);	// @ (0xE25 * 8 + 2)
#define                                 RPO38R2_bit         _BIT_ACCESS(RPOR38_39,2)
// RPOR38_39<RPO38R3>
extern volatile __bit                   RPO38R3             __at(0x712B);	// @ (0xE25 * 8 + 3)
#define                                 RPO38R3_bit         _BIT_ACCESS(RPOR38_39,3)
// RPOR38_39<RPO39R0>
extern volatile __bit                   RPO39R0             __at(0x712C);	// @ (0xE25 * 8 + 4)
#define                                 RPO39R0_bit         _BIT_ACCESS(RPOR38_39,4)
// RPOR38_39<RPO39R1>
extern volatile __bit                   RPO39R1             __at(0x712D);	// @ (0xE25 * 8 + 5)
#define                                 RPO39R1_bit         _BIT_ACCESS(RPOR38_39,5)
// RPOR38_39<RPO39R2>
extern volatile __bit                   RPO39R2             __at(0x712E);	// @ (0xE25 * 8 + 6)
#define                                 RPO39R2_bit         _BIT_ACCESS(RPOR38_39,6)
// RPOR38_39<RPO39R3>
extern volatile __bit                   RPO39R3             __at(0x712F);	// @ (0xE25 * 8 + 7)
#define                                 RPO39R3_bit         _BIT_ACCESS(RPOR38_39,7)
// RPOR2_3<RPO3R0>
extern volatile __bit                   RPO3R0              __at(0x709C);	// @ (0xE13 * 8 + 4)
#define                                 RPO3R0_bit          _BIT_ACCESS(RPOR2_3,4)
// RPOR2_3<RPO3R1>
extern volatile __bit                   RPO3R1              __at(0x709D);	// @ (0xE13 * 8 + 5)
#define                                 RPO3R1_bit          _BIT_ACCESS(RPOR2_3,5)
// RPOR2_3<RPO3R2>
extern volatile __bit                   RPO3R2              __at(0x709E);	// @ (0xE13 * 8 + 6)
#define                                 RPO3R2_bit          _BIT_ACCESS(RPOR2_3,6)
// RPOR2_3<RPO3R3>
extern volatile __bit                   RPO3R3              __at(0x709F);	// @ (0xE13 * 8 + 7)
#define                                 RPO3R3_bit          _BIT_ACCESS(RPOR2_3,7)
// RPOR40_41<RPO40R0>
extern volatile __bit                   RPO40R0             __at(0x7130);	// @ (0xE26 * 8 + 0)
#define                                 RPO40R0_bit         _BIT_ACCESS(RPOR40_41,0)
// RPOR40_41<RPO40R1>
extern volatile __bit                   RPO40R1             __at(0x7131);	// @ (0xE26 * 8 + 1)
#define                                 RPO40R1_bit         _BIT_ACCESS(RPOR40_41,1)
// RPOR40_41<RPO40R2>
extern volatile __bit                   RPO40R2             __at(0x7132);	// @ (0xE26 * 8 + 2)
#define                                 RPO40R2_bit         _BIT_ACCESS(RPOR40_41,2)
// RPOR40_41<RPO40R3>
extern volatile __bit                   RPO40R3             __at(0x7133);	// @ (0xE26 * 8 + 3)
#define                                 RPO40R3_bit         _BIT_ACCESS(RPOR40_41,3)
// RPOR40_41<RPO41R0>
extern volatile __bit                   RPO41R0             __at(0x7134);	// @ (0xE26 * 8 + 4)
#define                                 RPO41R0_bit         _BIT_ACCESS(RPOR40_41,4)
// RPOR40_41<RPO41R1>
extern volatile __bit                   RPO41R1             __at(0x7135);	// @ (0xE26 * 8 + 5)
#define                                 RPO41R1_bit         _BIT_ACCESS(RPOR40_41,5)
// RPOR40_41<RPO41R2>
extern volatile __bit                   RPO41R2             __at(0x7136);	// @ (0xE26 * 8 + 6)
#define                                 RPO41R2_bit         _BIT_ACCESS(RPOR40_41,6)
// RPOR40_41<RPO41R3>
extern volatile __bit                   RPO41R3             __at(0x7137);	// @ (0xE26 * 8 + 7)
#define                                 RPO41R3_bit         _BIT_ACCESS(RPOR40_41,7)
// RPOR42_43<RPO42R0>
extern volatile __bit                   RPO42R0             __at(0x7138);	// @ (0xE27 * 8 + 0)
#define                                 RPO42R0_bit         _BIT_ACCESS(RPOR42_43,0)
// RPOR42_43<RPO42R1>
extern volatile __bit                   RPO42R1             __at(0x7139);	// @ (0xE27 * 8 + 1)
#define                                 RPO42R1_bit         _BIT_ACCESS(RPOR42_43,1)
// RPOR42_43<RPO42R2>
extern volatile __bit                   RPO42R2             __at(0x713A);	// @ (0xE27 * 8 + 2)
#define                                 RPO42R2_bit         _BIT_ACCESS(RPOR42_43,2)
// RPOR42_43<RPO42R3>
extern volatile __bit                   RPO42R3             __at(0x713B);	// @ (0xE27 * 8 + 3)
#define                                 RPO42R3_bit         _BIT_ACCESS(RPOR42_43,3)
// RPOR42_43<RPO43R0>
extern volatile __bit                   RPO43R0             __at(0x713C);	// @ (0xE27 * 8 + 4)
#define                                 RPO43R0_bit         _BIT_ACCESS(RPOR42_43,4)
// RPOR42_43<RPO43R1>
extern volatile __bit                   RPO43R1             __at(0x713D);	// @ (0xE27 * 8 + 5)
#define                                 RPO43R1_bit         _BIT_ACCESS(RPOR42_43,5)
// RPOR42_43<RPO43R2>
extern volatile __bit                   RPO43R2             __at(0x713E);	// @ (0xE27 * 8 + 6)
#define                                 RPO43R2_bit         _BIT_ACCESS(RPOR42_43,6)
// RPOR42_43<RPO43R3>
extern volatile __bit                   RPO43R3             __at(0x713F);	// @ (0xE27 * 8 + 7)
#define                                 RPO43R3_bit         _BIT_ACCESS(RPOR42_43,7)
// RPOR44_45<RPO44R0>
extern volatile __bit                   RPO44R0             __at(0x7140);	// @ (0xE28 * 8 + 0)
#define                                 RPO44R0_bit         _BIT_ACCESS(RPOR44_45,0)
// RPOR44_45<RPO44R1>
extern volatile __bit                   RPO44R1             __at(0x7141);	// @ (0xE28 * 8 + 1)
#define                                 RPO44R1_bit         _BIT_ACCESS(RPOR44_45,1)
// RPOR44_45<RPO44R2>
extern volatile __bit                   RPO44R2             __at(0x7142);	// @ (0xE28 * 8 + 2)
#define                                 RPO44R2_bit         _BIT_ACCESS(RPOR44_45,2)
// RPOR44_45<RPO44R3>
extern volatile __bit                   RPO44R3             __at(0x7143);	// @ (0xE28 * 8 + 3)
#define                                 RPO44R3_bit         _BIT_ACCESS(RPOR44_45,3)
// RPOR44_45<RPO45R0>
extern volatile __bit                   RPO45R0             __at(0x7144);	// @ (0xE28 * 8 + 4)
#define                                 RPO45R0_bit         _BIT_ACCESS(RPOR44_45,4)
// RPOR44_45<RPO45R1>
extern volatile __bit                   RPO45R1             __at(0x7145);	// @ (0xE28 * 8 + 5)
#define                                 RPO45R1_bit         _BIT_ACCESS(RPOR44_45,5)
// RPOR44_45<RPO45R2>
extern volatile __bit                   RPO45R2             __at(0x7146);	// @ (0xE28 * 8 + 6)
#define                                 RPO45R2_bit         _BIT_ACCESS(RPOR44_45,6)
// RPOR44_45<RPO45R3>
extern volatile __bit                   RPO45R3             __at(0x7147);	// @ (0xE28 * 8 + 7)
#define                                 RPO45R3_bit         _BIT_ACCESS(RPOR44_45,7)
// RPOR46<RPO46R0>
extern volatile __bit                   RPO46R0             __at(0x7148);	// @ (0xE29 * 8 + 0)
#define                                 RPO46R0_bit         _BIT_ACCESS(RPOR46,0)
// RPOR46<RPO46R1>
extern volatile __bit                   RPO46R1             __at(0x7149);	// @ (0xE29 * 8 + 1)
#define                                 RPO46R1_bit         _BIT_ACCESS(RPOR46,1)
// RPOR46<RPO46R2>
extern volatile __bit                   RPO46R2             __at(0x714A);	// @ (0xE29 * 8 + 2)
#define                                 RPO46R2_bit         _BIT_ACCESS(RPOR46,2)
// RPOR46<RPO46R3>
extern volatile __bit                   RPO46R3             __at(0x714B);	// @ (0xE29 * 8 + 3)
#define                                 RPO46R3_bit         _BIT_ACCESS(RPOR46,3)
// RPOR4_5<RPO4R0>
extern volatile __bit                   RPO4R0              __at(0x70A0);	// @ (0xE14 * 8 + 0)
#define                                 RPO4R0_bit          _BIT_ACCESS(RPOR4_5,0)
// RPOR4_5<RPO4R1>
extern volatile __bit                   RPO4R1              __at(0x70A1);	// @ (0xE14 * 8 + 1)
#define                                 RPO4R1_bit          _BIT_ACCESS(RPOR4_5,1)
// RPOR4_5<RPO4R2>
extern volatile __bit                   RPO4R2              __at(0x70A2);	// @ (0xE14 * 8 + 2)
#define                                 RPO4R2_bit          _BIT_ACCESS(RPOR4_5,2)
// RPOR4_5<RPO4R3>
extern volatile __bit                   RPO4R3              __at(0x70A3);	// @ (0xE14 * 8 + 3)
#define                                 RPO4R3_bit          _BIT_ACCESS(RPOR4_5,3)
// RPOR4_5<RPO5R0>
extern volatile __bit                   RPO5R0              __at(0x70A4);	// @ (0xE14 * 8 + 4)
#define                                 RPO5R0_bit          _BIT_ACCESS(RPOR4_5,4)
// RPOR4_5<RPO5R1>
extern volatile __bit                   RPO5R1              __at(0x70A5);	// @ (0xE14 * 8 + 5)
#define                                 RPO5R1_bit          _BIT_ACCESS(RPOR4_5,5)
// RPOR4_5<RPO5R2>
extern volatile __bit                   RPO5R2              __at(0x70A6);	// @ (0xE14 * 8 + 6)
#define                                 RPO5R2_bit          _BIT_ACCESS(RPOR4_5,6)
// RPOR4_5<RPO5R3>
extern volatile __bit                   RPO5R3              __at(0x70A7);	// @ (0xE14 * 8 + 7)
