MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J94/mcu.h
#define                                 RPO5R3_bit          _BIT_ACCESS(RPOR4_5,7)
// RPOR6_7<RPO6R0>
extern volatile __bit                   RPO6R0              __at(0x70A8);	// @ (0xE15 * 8 + 0)
#define                                 RPO6R0_bit          _BIT_ACCESS(RPOR6_7,0)
// RPOR6_7<RPO6R1>
extern volatile __bit                   RPO6R1              __at(0x70A9);	// @ (0xE15 * 8 + 1)
#define                                 RPO6R1_bit          _BIT_ACCESS(RPOR6_7,1)
// RPOR6_7<RPO6R2>
extern volatile __bit                   RPO6R2              __at(0x70AA);	// @ (0xE15 * 8 + 2)
#define                                 RPO6R2_bit          _BIT_ACCESS(RPOR6_7,2)
// RPOR6_7<RPO6R3>
extern volatile __bit                   RPO6R3              __at(0x70AB);	// @ (0xE15 * 8 + 3)
#define                                 RPO6R3_bit          _BIT_ACCESS(RPOR6_7,3)
// RPOR6_7<RPO7R0>
extern volatile __bit                   RPO7R0              __at(0x70AC);	// @ (0xE15 * 8 + 4)
#define                                 RPO7R0_bit          _BIT_ACCESS(RPOR6_7,4)
// RPOR6_7<RPO7R1>
extern volatile __bit                   RPO7R1              __at(0x70AD);	// @ (0xE15 * 8 + 5)
#define                                 RPO7R1_bit          _BIT_ACCESS(RPOR6_7,5)
// RPOR6_7<RPO7R2>
extern volatile __bit                   RPO7R2              __at(0x70AE);	// @ (0xE15 * 8 + 6)
#define                                 RPO7R2_bit          _BIT_ACCESS(RPOR6_7,6)
// RPOR6_7<RPO7R3>
extern volatile __bit                   RPO7R3              __at(0x70AF);	// @ (0xE15 * 8 + 7)
#define                                 RPO7R3_bit          _BIT_ACCESS(RPOR6_7,7)
// RPOR8_9<RPO8R0>
extern volatile __bit                   RPO8R0              __at(0x70B0);	// @ (0xE16 * 8 + 0)
#define                                 RPO8R0_bit          _BIT_ACCESS(RPOR8_9,0)
// RPOR8_9<RPO8R1>
extern volatile __bit                   RPO8R1              __at(0x70B1);	// @ (0xE16 * 8 + 1)
#define                                 RPO8R1_bit          _BIT_ACCESS(RPOR8_9,1)
// RPOR8_9<RPO8R2>
extern volatile __bit                   RPO8R2              __at(0x70B2);	// @ (0xE16 * 8 + 2)
#define                                 RPO8R2_bit          _BIT_ACCESS(RPOR8_9,2)
// RPOR8_9<RPO8R3>
extern volatile __bit                   RPO8R3              __at(0x70B3);	// @ (0xE16 * 8 + 3)
#define                                 RPO8R3_bit          _BIT_ACCESS(RPOR8_9,3)
// RPOR8_9<RPO9R0>
extern volatile __bit                   RPO9R0              __at(0x70B4);	// @ (0xE16 * 8 + 4)
#define                                 RPO9R0_bit          _BIT_ACCESS(RPOR8_9,4)
// RPOR8_9<RPO9R1>
extern volatile __bit                   RPO9R1              __at(0x70B5);	// @ (0xE16 * 8 + 5)
#define                                 RPO9R1_bit          _BIT_ACCESS(RPOR8_9,5)
// RPOR8_9<RPO9R2>
extern volatile __bit                   RPO9R2              __at(0x70B6);	// @ (0xE16 * 8 + 6)
#define                                 RPO9R2_bit          _BIT_ACCESS(RPOR8_9,6)
// RPOR8_9<RPO9R3>
extern volatile __bit                   RPO9R3              __at(0x70B7);	// @ (0xE16 * 8 + 7)
#define                                 RPO9R3_bit          _BIT_ACCESS(RPOR8_9,7)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SSP2CON2<RSEN2>
extern volatile __bit                   RSEN2               __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 RSEN2_bit           _BIT_ACCESS(SSP2CON2,1)
// PIE3<RTCCIE>
extern volatile __bit                   RTCCIE              __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 RTCCIE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<RTCCIF>
extern volatile __bit                   RTCCIF              __at(0x7D20);	// @ (0xFA4 * 8 + 0)
#define                                 RTCCIF_bit          _BIT_ACCESS(PIR3,0)
// IPR3<RTCCIP>
extern volatile __bit                   RTCCIP              __at(0x7D28);	// @ (0xFA5 * 8 + 0)
#define                                 RTCCIP_bit          _BIT_ACCESS(IPR3,0)
// RTCCON2<RTCCLKSEL0>
extern volatile __bit                   RTCCLKSEL0          __at(0x7ABA);	// @ (0xF57 * 8 + 2)
#define                                 RTCCLKSEL0_bit      _BIT_ACCESS(RTCCON2,2)
// RTCCON2<RTCCLKSEL1>
extern volatile __bit                   RTCCLKSEL1          __at(0x7ABB);	// @ (0xF57 * 8 + 3)
#define                                 RTCCLKSEL1_bit      _BIT_ACCESS(RTCCON2,3)
// PMD3<RTCCMD>
extern volatile __bit                   RTCCMD              __at(0x778C);	// @ (0xEF1 * 8 + 4)
#define                                 RTCCMD_bit          _BIT_ACCESS(PMD3,4)
// RTCCON1<RTCEN>
extern volatile __bit                   RTCEN               __at(0x7AFF);	// @ (0xF5F * 8 + 7)
#define                                 RTCEN_bit           _BIT_ACCESS(RTCCON1,7)
// RTCCON1<RTCOE>
extern volatile __bit                   RTCOE               __at(0x7AFA);	// @ (0xF5F * 8 + 2)
#define                                 RTCOE_bit           _BIT_ACCESS(RTCCON1,2)
// RTCCON1<RTCPTR0>
extern volatile __bit                   RTCPTR0             __at(0x7AF8);	// @ (0xF5F * 8 + 0)
#define                                 RTCPTR0_bit         _BIT_ACCESS(RTCCON1,0)
// RTCCON1<RTCPTR1>
extern volatile __bit                   RTCPTR1             __at(0x7AF9);	// @ (0xF5F * 8 + 1)
#define                                 RTCPTR1_bit         _BIT_ACCESS(RTCCON1,1)
// RTCCON2<RTCSECSEL0>
extern volatile __bit                   RTCSECSEL0          __at(0x7AB8);	// @ (0xF57 * 8 + 0)
#define                                 RTCSECSEL0_bit      _BIT_ACCESS(RTCCON2,0)
// RTCCON2<RTCSECSEL1>
extern volatile __bit                   RTCSECSEL1          __at(0x7AB9);	// @ (0xF57 * 8 + 1)
#define                                 RTCSECSEL1_bit      _BIT_ACCESS(RTCCON2,1)
// RTCCON1<RTCSYNC>
extern volatile __bit                   RTCSYNC             __at(0x7AFC);	// @ (0xF5F * 8 + 4)
#define                                 RTCSYNC_bit         _BIT_ACCESS(RTCCON1,4)
// DSCONH<RTCWDIS>
extern volatile __bit                   RTCWDIS             __at(0x7938);	// @ (0xF27 * 8 + 0)
#define                                 RTCWDIS_bit         _BIT_ACCESS(DSCONH,0)
// RTCCON1<RTCWREN>
extern volatile __bit                   RTCWREN             __at(0x7AFD);	// @ (0xF5F * 8 + 5)
#define                                 RTCWREN_bit         _BIT_ACCESS(RTCCON1,5)
// PORTVP<RVP0>
extern volatile __bit                   RVP0                __at(0x7B88);	// @ (0xF71 * 8 + 0)
#define                                 RVP0_bit            _BIT_ACCESS(PORTVP,0)
// PORTVP<RVP1>
extern volatile __bit                   RVP1                __at(0x7B89);	// @ (0xF71 * 8 + 1)
#define                                 RVP1_bit            _BIT_ACCESS(PORTVP,1)
// PORTVP<RVP2>
extern volatile __bit                   RVP2                __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 RVP2_bit            _BIT_ACCESS(PORTVP,2)
// PORTVP<RVP3>
extern volatile __bit                   RVP3                __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 RVP3_bit            _BIT_ACCESS(PORTVP,3)
// PORTVP<RVP4>
extern volatile __bit                   RVP4                __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 RVP4_bit            _BIT_ACCESS(PORTVP,4)
// PORTVP<RVP5>
extern volatile __bit                   RVP5                __at(0x7B8D);	// @ (0xF71 * 8 + 5)
#define                                 RVP5_bit            _BIT_ACCESS(PORTVP,5)
// PORTVP<RVP6>
extern volatile __bit                   RVP6                __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 RVP6_bit            _BIT_ACCESS(PORTVP,6)
// PORTVP<RVP7>
extern volatile __bit                   RVP7                __at(0x7B8F);	// @ (0xF71 * 8 + 7)
#define                                 RVP7_bit            _BIT_ACCESS(PORTVP,7)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<RW2>
extern volatile __bit                   RW2                 __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 RW2_bit             _BIT_ACCESS(SSP2STAT,2)
// RXADDRL<RXADDR0>
extern volatile __bit                   RXADDR0             __at(0x7B70);	// @ (0xF6E * 8 + 0)
#define                                 RXADDR0_bit         _BIT_ACCESS(RXADDRL,0)
// RXADDRL<RXADDR1>
extern volatile __bit                   RXADDR1             __at(0x7B71);	// @ (0xF6E * 8 + 1)
#define                                 RXADDR1_bit         _BIT_ACCESS(RXADDRL,1)
// RXADDRH<RXADDR10>
extern volatile __bit                   RXADDR10            __at(0x7B6A);	// @ (0xF6D * 8 + 2)
#define                                 RXADDR10_bit        _BIT_ACCESS(RXADDRH,2)
// RXADDRH<RXADDR11>
extern volatile __bit                   RXADDR11            __at(0x7B6B);	// @ (0xF6D * 8 + 3)
#define                                 RXADDR11_bit        _BIT_ACCESS(RXADDRH,3)
// RXADDRL<RXADDR2>
extern volatile __bit                   RXADDR2             __at(0x7B72);	// @ (0xF6E * 8 + 2)
#define                                 RXADDR2_bit         _BIT_ACCESS(RXADDRL,2)
// RXADDRL<RXADDR3>
extern volatile __bit                   RXADDR3             __at(0x7B73);	// @ (0xF6E * 8 + 3)
#define                                 RXADDR3_bit         _BIT_ACCESS(RXADDRL,3)
// RXADDRL<RXADDR4>
extern volatile __bit                   RXADDR4             __at(0x7B74);	// @ (0xF6E * 8 + 4)
#define                                 RXADDR4_bit         _BIT_ACCESS(RXADDRL,4)
// RXADDRL<RXADDR5>
extern volatile __bit                   RXADDR5             __at(0x7B75);	// @ (0xF6E * 8 + 5)
#define                                 RXADDR5_bit         _BIT_ACCESS(RXADDRL,5)
// RXADDRL<RXADDR6>
extern volatile __bit                   RXADDR6             __at(0x7B76);	// @ (0xF6E * 8 + 6)
#define                                 RXADDR6_bit         _BIT_ACCESS(RXADDRL,6)
// RXADDRL<RXADDR7>
extern volatile __bit                   RXADDR7             __at(0x7B77);	// @ (0xF6E * 8 + 7)
#define                                 RXADDR7_bit         _BIT_ACCESS(RXADDRL,7)
// RXADDRH<RXADDR8>
extern volatile __bit                   RXADDR8             __at(0x7B68);	// @ (0xF6D * 8 + 0)
#define                                 RXADDR8_bit         _BIT_ACCESS(RXADDRH,0)
// RXADDRH<RXADDR9>
extern volatile __bit                   RXADDR9             __at(0x7B69);	// @ (0xF6D * 8 + 1)
#define                                 RXADDR9_bit         _BIT_ACCESS(RXADDRH,1)
// PIE3<RXB0IE>
extern volatile __bit                   RXB0IE              __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 RXB0IE_bit          _BIT_ACCESS(PIE3,0)
// PIE3<RXB1IE>
extern volatile __bit                   RXB1IE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXB1IE_bit          _BIT_ACCESS(PIE3,1)
// PIE3<RXBNIE>
extern volatile __bit                   RXBNIE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXBNIE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<RXBNIF>
extern volatile __bit                   RXBNIF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 RXBNIF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<RXBNIP>
extern volatile __bit                   RXBNIP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 RXBNIP_bit          _BIT_ACCESS(IPR3,1)
// BAUDCON1<RXCKP>
extern volatile __bit                   RXCKP               __at(0x7B3D);	// @ (0xF67 * 8 + 5)
#define                                 RXCKP_bit           _BIT_ACCESS(BAUDCON1,5)
// BAUDCON1<RXDTP1>
extern volatile __bit                   RXDTP1              __at(0x7B3D);	// @ (0xF67 * 8 + 5)
#define                                 RXDTP1_bit          _BIT_ACCESS(BAUDCON1,5)
// BAUDCON2<RXDTP2>
extern volatile __bit                   RXDTP2              __at(0x798D);	// @ (0xF31 * 8 + 5)
#define                                 RXDTP2_bit          _BIT_ACCESS(BAUDCON2,5)
// BAUDCON3<RXDTP3>
extern volatile __bit                   RXDTP3              __at(0x796D);	// @ (0xF2D * 8 + 5)
#define                                 RXDTP3_bit          _BIT_ACCESS(BAUDCON3,5)
// BAUDCON4<RXDTP4>
extern volatile __bit                   RXDTP4              __at(0x77ED);	// @ (0xEFD * 8 + 5)
#define                                 RXDTP4_bit          _BIT_ACCESS(BAUDCON4,5)
// DMACON1<RXINC>
extern volatile __bit                   RXINC               __at(0x7B04);	// @ (0xF60 * 8 + 4)
#define                                 RXINC_bit           _BIT_ACCESS(DMACON1,4)
// SSP1STAT<R_NOT_W1>
extern volatile __bit                   R_NOT_W1            __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_NOT_W1_bit        _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_NOT_W2>
extern volatile __bit                   R_NOT_W2            __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 R_NOT_W2_bit        _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<R_W1>
extern volatile __bit                   R_W1                __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_W1_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_W2>
extern volatile __bit                   R_W2                __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 R_W2_bit            _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<R_nW1>
extern volatile __bit                   R_nW1               __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_nW1_bit           _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<R_nW2>
extern volatile __bit                   R_nW2               __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 R_nW2_bit           _BIT_ACCESS(SSP2STAT,2)
// LCDDATA0<S00C0>
extern volatile __bit                   S00C0               __at(0x7470);	// @ (0xE8E * 8 + 0)
#define                                 S00C0_bit           _BIT_ACCESS(LCDDATA0,0)
// LCDDATA8<S00C1>
extern volatile __bit                   S00C1               __at(0x74B0);	// @ (0xE96 * 8 + 0)
#define                                 S00C1_bit           _BIT_ACCESS(LCDDATA8,0)
// LCDDATA16<S00C2>
extern volatile __bit                   S00C2               __at(0x74F0);	// @ (0xE9E * 8 + 0)
#define                                 S00C2_bit           _BIT_ACCESS(LCDDATA16,0)
// LCDDATA24<S00C3>
extern volatile __bit                   S00C3               __at(0x7530);	// @ (0xEA6 * 8 + 0)
#define                                 S00C3_bit           _BIT_ACCESS(LCDDATA24,0)
// LCDDATA32<S00C4>
extern volatile __bit                   S00C4               __at(0x7570);	// @ (0xEAE * 8 + 0)
#define                                 S00C4_bit           _BIT_ACCESS(LCDDATA32,0)
// LCDDATA40<S00C5>
extern volatile __bit                   S00C5               __at(0x75B0);	// @ (0xEB6 * 8 + 0)
#define                                 S00C5_bit           _BIT_ACCESS(LCDDATA40,0)
// LCDDATA48<S00C6>
extern volatile __bit                   S00C6               __at(0x75F0);	// @ (0xEBE * 8 + 0)
#define                                 S00C6_bit           _BIT_ACCESS(LCDDATA48,0)
// LCDDATA56<S00C7>
extern volatile __bit                   S00C7               __at(0x7630);	// @ (0xEC6 * 8 + 0)
#define                                 S00C7_bit           _BIT_ACCESS(LCDDATA56,0)
// LCDDATA0<S01C0>
extern volatile __bit                   S01C0               __at(0x7471);	// @ (0xE8E * 8 + 1)
#define                                 S01C0_bit           _BIT_ACCESS(LCDDATA0,1)
// LCDDATA8<S01C1>
extern volatile __bit                   S01C1               __at(0x74B1);	// @ (0xE96 * 8 + 1)
#define                                 S01C1_bit           _BIT_ACCESS(LCDDATA8,1)
// LCDDATA16<S01C2>
extern volatile __bit                   S01C2               __at(0x74F1);	// @ (0xE9E * 8 + 1)
#define                                 S01C2_bit           _BIT_ACCESS(LCDDATA16,1)
// LCDDATA24<S01C3>
extern volatile __bit                   S01C3               __at(0x7531);	// @ (0xEA6 * 8 + 1)
#define                                 S01C3_bit           _BIT_ACCESS(LCDDATA24,1)
// LCDDATA32<S01C4>
extern volatile __bit                   S01C4               __at(0x7571);	// @ (0xEAE * 8 + 1)
#define                                 S01C4_bit           _BIT_ACCESS(LCDDATA32,1)
// LCDDATA40<S01C5>
extern volatile __bit                   S01C5               __at(0x75B1);	// @ (0xEB6 * 8 + 1)
#define                                 S01C5_bit           _BIT_ACCESS(LCDDATA40,1)
// LCDDATA48<S01C6>
extern volatile __bit                   S01C6               __at(0x75F1);	// @ (0xEBE * 8 + 1)
#define                                 S01C6_bit           _BIT_ACCESS(LCDDATA48,1)
// LCDDATA56<S01C7>
extern volatile __bit                   S01C7               __at(0x7631);	// @ (0xEC6 * 8 + 1)
#define                                 S01C7_bit           _BIT_ACCESS(LCDDATA56,1)
// LCDDATA0<S02C0>
extern volatile __bit                   S02C0               __at(0x7472);	// @ (0xE8E * 8 + 2)
#define                                 S02C0_bit           _BIT_ACCESS(LCDDATA0,2)
// LCDDATA8<S02C1>
extern volatile __bit                   S02C1               __at(0x74B2);	// @ (0xE96 * 8 + 2)
#define                                 S02C1_bit           _BIT_ACCESS(LCDDATA8,2)
// LCDDATA16<S02C2>
extern volatile __bit                   S02C2               __at(0x74F2);	// @ (0xE9E * 8 + 2)
#define                                 S02C2_bit           _BIT_ACCESS(LCDDATA16,2)
// LCDDATA24<S02C3>
extern volatile __bit                   S02C3               __at(0x7532);	// @ (0xEA6 * 8 + 2)
#define                                 S02C3_bit           _BIT_ACCESS(LCDDATA24,2)
// LCDDATA32<S02C4>
extern volatile __bit                   S02C4               __at(0x7572);	// @ (0xEAE * 8 + 2)
#define                                 S02C4_bit           _BIT_ACCESS(LCDDATA32,2)
// LCDDATA40<S02C5>
extern volatile __bit                   S02C5               __at(0x75B2);	// @ (0xEB6 * 8 + 2)
#define                                 S02C5_bit           _BIT_ACCESS(LCDDATA40,2)
// LCDDATA48<S02C6>
extern volatile __bit                   S02C6               __at(0x75F2);	// @ (0xEBE * 8 + 2)
#define                                 S02C6_bit           _BIT_ACCESS(LCDDATA48,2)
// LCDDATA56<S02C7>
extern volatile __bit                   S02C7               __at(0x7632);	// @ (0xEC6 * 8 + 2)
#define                                 S02C7_bit           _BIT_ACCESS(LCDDATA56,2)
// LCDDATA0<S03C0>
extern volatile __bit                   S03C0               __at(0x7473);	// @ (0xE8E * 8 + 3)
#define                                 S03C0_bit           _BIT_ACCESS(LCDDATA0,3)
// LCDDATA8<S03C1>
extern volatile __bit                   S03C1               __at(0x74B3);	// @ (0xE96 * 8 + 3)
#define                                 S03C1_bit           _BIT_ACCESS(LCDDATA8,3)
// LCDDATA16<S03C2>
extern volatile __bit                   S03C2               __at(0x74F3);	// @ (0xE9E * 8 + 3)
#define                                 S03C2_bit           _BIT_ACCESS(LCDDATA16,3)
// LCDDATA24<S03C3>
extern volatile __bit                   S03C3               __at(0x7533);	// @ (0xEA6 * 8 + 3)
#define                                 S03C3_bit           _BIT_ACCESS(LCDDATA24,3)
// LCDDATA32<S03C4>
extern volatile __bit                   S03C4               __at(0x7573);	// @ (0xEAE * 8 + 3)
#define                                 S03C4_bit           _BIT_ACCESS(LCDDATA32,3)
// LCDDATA40<S03C5>
extern volatile __bit                   S03C5               __at(0x75B3);	// @ (0xEB6 * 8 + 3)
#define                                 S03C5_bit           _BIT_ACCESS(LCDDATA40,3)
// LCDDATA48<S03C6>
extern volatile __bit                   S03C6               __at(0x75F3);	// @ (0xEBE * 8 + 3)
#define                                 S03C6_bit           _BIT_ACCESS(LCDDATA48,3)
// LCDDATA56<S03C7>
extern volatile __bit                   S03C7               __at(0x7633);	// @ (0xEC6 * 8 + 3)
#define                                 S03C7_bit           _BIT_ACCESS(LCDDATA56,3)
// LCDDATA0<S04C0>
extern volatile __bit                   S04C0               __at(0x7474);	// @ (0xE8E * 8 + 4)
#define                                 S04C0_bit           _BIT_ACCESS(LCDDATA0,4)
// LCDDATA8<S04C1>
extern volatile __bit                   S04C1               __at(0x74B4);	// @ (0xE96 * 8 + 4)
#define                                 S04C1_bit           _BIT_ACCESS(LCDDATA8,4)
// LCDDATA16<S04C2>
extern volatile __bit                   S04C2               __at(0x74F4);	// @ (0xE9E * 8 + 4)
#define                                 S04C2_bit           _BIT_ACCESS(LCDDATA16,4)
// LCDDATA24<S04C3>
extern volatile __bit                   S04C3               __at(0x7534);	// @ (0xEA6 * 8 + 4)
#define                                 S04C3_bit           _BIT_ACCESS(LCDDATA24,4)
// LCDDATA32<S04C4>
extern volatile __bit                   S04C4               __at(0x7574);	// @ (0xEAE * 8 + 4)
#define                                 S04C4_bit           _BIT_ACCESS(LCDDATA32,4)
// LCDDATA40<S04C5>
extern volatile __bit                   S04C5               __at(0x75B4);	// @ (0xEB6 * 8 + 4)
#define                                 S04C5_bit           _BIT_ACCESS(LCDDATA40,4)
// LCDDATA48<S04C6>
extern volatile __bit                   S04C6               __at(0x75F4);	// @ (0xEBE * 8 + 4)
#define                                 S04C6_bit           _BIT_ACCESS(LCDDATA48,4)
// LCDDATA56<S04C7>
extern volatile __bit                   S04C7               __at(0x7634);	// @ (0xEC6 * 8 + 4)
#define                                 S04C7_bit           _BIT_ACCESS(LCDDATA56,4)
// LCDDATA0<S05C0>
extern volatile __bit                   S05C0               __at(0x7475);	// @ (0xE8E * 8 + 5)
#define                                 S05C0_bit           _BIT_ACCESS(LCDDATA0,5)
// LCDDATA8<S05C1>
extern volatile __bit                   S05C1               __at(0x74B5);	// @ (0xE96 * 8 + 5)
#define                                 S05C1_bit           _BIT_ACCESS(LCDDATA8,5)
// LCDDATA16<S05C2>
extern volatile __bit                   S05C2               __at(0x74F5);	// @ (0xE9E * 8 + 5)
#define                                 S05C2_bit           _BIT_ACCESS(LCDDATA16,5)
// LCDDATA24<S05C3>
extern volatile __bit                   S05C3               __at(0x7535);	// @ (0xEA6 * 8 + 5)
#define                                 S05C3_bit           _BIT_ACCESS(LCDDATA24,5)
// LCDDATA32<S05C4>
extern volatile __bit                   S05C4               __at(0x7575);	// @ (0xEAE * 8 + 5)
#define                                 S05C4_bit           _BIT_ACCESS(LCDDATA32,5)
// LCDDATA40<S05C5>
extern volatile __bit                   S05C5               __at(0x75B5);	// @ (0xEB6 * 8 + 5)
#define                                 S05C5_bit           _BIT_ACCESS(LCDDATA40,5)
// LCDDATA48<S05C6>
extern volatile __bit                   S05C6               __at(0x75F5);	// @ (0xEBE * 8 + 5)
#define                                 S05C6_bit           _BIT_ACCESS(LCDDATA48,5)
// LCDDATA56<S05C7>
extern volatile __bit                   S05C7               __at(0x7635);	// @ (0xEC6 * 8 + 5)
#define                                 S05C7_bit           _BIT_ACCESS(LCDDATA56,5)
// LCDDATA0<S06C0>
extern volatile __bit                   S06C0               __at(0x7476);	// @ (0xE8E * 8 + 6)
