MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J94/mcu.h
#define                                 S21C0_bit           _BIT_ACCESS(LCDDATA2,5)
// LCDDATA10<S21C1>
extern volatile __bit                   S21C1               __at(0x74C5);	// @ (0xE98 * 8 + 5)
#define                                 S21C1_bit           _BIT_ACCESS(LCDDATA10,5)
// LCDDATA18<S21C2>
extern volatile __bit                   S21C2               __at(0x7505);	// @ (0xEA0 * 8 + 5)
#define                                 S21C2_bit           _BIT_ACCESS(LCDDATA18,5)
// LCDDATA26<S21C3>
extern volatile __bit                   S21C3               __at(0x7545);	// @ (0xEA8 * 8 + 5)
#define                                 S21C3_bit           _BIT_ACCESS(LCDDATA26,5)
// LCDDATA34<S21C4>
extern volatile __bit                   S21C4               __at(0x7585);	// @ (0xEB0 * 8 + 5)
#define                                 S21C4_bit           _BIT_ACCESS(LCDDATA34,5)
// LCDDATA42<S21C5>
extern volatile __bit                   S21C5               __at(0x75C5);	// @ (0xEB8 * 8 + 5)
#define                                 S21C5_bit           _BIT_ACCESS(LCDDATA42,5)
// LCDDATA50<S21C6>
extern volatile __bit                   S21C6               __at(0x7605);	// @ (0xEC0 * 8 + 5)
#define                                 S21C6_bit           _BIT_ACCESS(LCDDATA50,5)
// LCDDATA58<S21C7>
extern volatile __bit                   S21C7               __at(0x7645);	// @ (0xEC8 * 8 + 5)
#define                                 S21C7_bit           _BIT_ACCESS(LCDDATA58,5)
// LCDDATA2<S22C0>
extern volatile __bit                   S22C0               __at(0x7486);	// @ (0xE90 * 8 + 6)
#define                                 S22C0_bit           _BIT_ACCESS(LCDDATA2,6)
// LCDDATA10<S22C1>
extern volatile __bit                   S22C1               __at(0x74C6);	// @ (0xE98 * 8 + 6)
#define                                 S22C1_bit           _BIT_ACCESS(LCDDATA10,6)
// LCDDATA18<S22C2>
extern volatile __bit                   S22C2               __at(0x7506);	// @ (0xEA0 * 8 + 6)
#define                                 S22C2_bit           _BIT_ACCESS(LCDDATA18,6)
// LCDDATA26<S22C3>
extern volatile __bit                   S22C3               __at(0x7546);	// @ (0xEA8 * 8 + 6)
#define                                 S22C3_bit           _BIT_ACCESS(LCDDATA26,6)
// LCDDATA34<S22C4>
extern volatile __bit                   S22C4               __at(0x7586);	// @ (0xEB0 * 8 + 6)
#define                                 S22C4_bit           _BIT_ACCESS(LCDDATA34,6)
// LCDDATA42<S22C5>
extern volatile __bit                   S22C5               __at(0x75C6);	// @ (0xEB8 * 8 + 6)
#define                                 S22C5_bit           _BIT_ACCESS(LCDDATA42,6)
// LCDDATA50<S22C6>
extern volatile __bit                   S22C6               __at(0x7606);	// @ (0xEC0 * 8 + 6)
#define                                 S22C6_bit           _BIT_ACCESS(LCDDATA50,6)
// LCDDATA58<S22C7>
extern volatile __bit                   S22C7               __at(0x7646);	// @ (0xEC8 * 8 + 6)
#define                                 S22C7_bit           _BIT_ACCESS(LCDDATA58,6)
// LCDDATA2<S23C0>
extern volatile __bit                   S23C0               __at(0x7487);	// @ (0xE90 * 8 + 7)
#define                                 S23C0_bit           _BIT_ACCESS(LCDDATA2,7)
// LCDDATA10<S23C1>
extern volatile __bit                   S23C1               __at(0x74C7);	// @ (0xE98 * 8 + 7)
#define                                 S23C1_bit           _BIT_ACCESS(LCDDATA10,7)
// LCDDATA18<S23C2>
extern volatile __bit                   S23C2               __at(0x7507);	// @ (0xEA0 * 8 + 7)
#define                                 S23C2_bit           _BIT_ACCESS(LCDDATA18,7)
// LCDDATA26<S23C3>
extern volatile __bit                   S23C3               __at(0x7547);	// @ (0xEA8 * 8 + 7)
#define                                 S23C3_bit           _BIT_ACCESS(LCDDATA26,7)
// LCDDATA34<S23C4>
extern volatile __bit                   S23C4               __at(0x7587);	// @ (0xEB0 * 8 + 7)
#define                                 S23C4_bit           _BIT_ACCESS(LCDDATA34,7)
// LCDDATA42<S23C5>
extern volatile __bit                   S23C5               __at(0x75C7);	// @ (0xEB8 * 8 + 7)
#define                                 S23C5_bit           _BIT_ACCESS(LCDDATA42,7)
// LCDDATA50<S23C6>
extern volatile __bit                   S23C6               __at(0x7607);	// @ (0xEC0 * 8 + 7)
#define                                 S23C6_bit           _BIT_ACCESS(LCDDATA50,7)
// LCDDATA58<S23C7>
extern volatile __bit                   S23C7               __at(0x7647);	// @ (0xEC8 * 8 + 7)
#define                                 S23C7_bit           _BIT_ACCESS(LCDDATA58,7)
// LCDDATA3<S24C0>
extern volatile __bit                   S24C0               __at(0x7488);	// @ (0xE91 * 8 + 0)
#define                                 S24C0_bit           _BIT_ACCESS(LCDDATA3,0)
// LCDDATA11<S24C1>
extern volatile __bit                   S24C1               __at(0x74C8);	// @ (0xE99 * 8 + 0)
#define                                 S24C1_bit           _BIT_ACCESS(LCDDATA11,0)
// LCDDATA19<S24C2>
extern volatile __bit                   S24C2               __at(0x7508);	// @ (0xEA1 * 8 + 0)
#define                                 S24C2_bit           _BIT_ACCESS(LCDDATA19,0)
// LCDDATA27<S24C3>
extern volatile __bit                   S24C3               __at(0x7548);	// @ (0xEA9 * 8 + 0)
#define                                 S24C3_bit           _BIT_ACCESS(LCDDATA27,0)
// LCDDATA35<S24C4>
extern volatile __bit                   S24C4               __at(0x7588);	// @ (0xEB1 * 8 + 0)
#define                                 S24C4_bit           _BIT_ACCESS(LCDDATA35,0)
// LCDDATA43<S24C5>
extern volatile __bit                   S24C5               __at(0x75C8);	// @ (0xEB9 * 8 + 0)
#define                                 S24C5_bit           _BIT_ACCESS(LCDDATA43,0)
// LCDDATA51<S24C6>
extern volatile __bit                   S24C6               __at(0x7608);	// @ (0xEC1 * 8 + 0)
#define                                 S24C6_bit           _BIT_ACCESS(LCDDATA51,0)
// LCDDATA59<S24C7>
extern volatile __bit                   S24C7               __at(0x7648);	// @ (0xEC9 * 8 + 0)
#define                                 S24C7_bit           _BIT_ACCESS(LCDDATA59,0)
// LCDDATA3<S25C0>
extern volatile __bit                   S25C0               __at(0x7489);	// @ (0xE91 * 8 + 1)
#define                                 S25C0_bit           _BIT_ACCESS(LCDDATA3,1)
// LCDDATA11<S25C1>
extern volatile __bit                   S25C1               __at(0x74C9);	// @ (0xE99 * 8 + 1)
#define                                 S25C1_bit           _BIT_ACCESS(LCDDATA11,1)
// LCDDATA19<S25C2>
extern volatile __bit                   S25C2               __at(0x7509);	// @ (0xEA1 * 8 + 1)
#define                                 S25C2_bit           _BIT_ACCESS(LCDDATA19,1)
// LCDDATA27<S25C3>
extern volatile __bit                   S25C3               __at(0x7549);	// @ (0xEA9 * 8 + 1)
#define                                 S25C3_bit           _BIT_ACCESS(LCDDATA27,1)
// LCDDATA35<S25C4>
extern volatile __bit                   S25C4               __at(0x7589);	// @ (0xEB1 * 8 + 1)
#define                                 S25C4_bit           _BIT_ACCESS(LCDDATA35,1)
// LCDDATA43<S25C5>
extern volatile __bit                   S25C5               __at(0x75C9);	// @ (0xEB9 * 8 + 1)
#define                                 S25C5_bit           _BIT_ACCESS(LCDDATA43,1)
// LCDDATA51<S25C6>
extern volatile __bit                   S25C6               __at(0x7609);	// @ (0xEC1 * 8 + 1)
#define                                 S25C6_bit           _BIT_ACCESS(LCDDATA51,1)
// LCDDATA59<S25C7>
extern volatile __bit                   S25C7               __at(0x7649);	// @ (0xEC9 * 8 + 1)
#define                                 S25C7_bit           _BIT_ACCESS(LCDDATA59,1)
// LCDDATA3<S26C0>
extern volatile __bit                   S26C0               __at(0x748A);	// @ (0xE91 * 8 + 2)
#define                                 S26C0_bit           _BIT_ACCESS(LCDDATA3,2)
// LCDDATA11<S26C1>
extern volatile __bit                   S26C1               __at(0x74CA);	// @ (0xE99 * 8 + 2)
#define                                 S26C1_bit           _BIT_ACCESS(LCDDATA11,2)
// LCDDATA19<S26C2>
extern volatile __bit                   S26C2               __at(0x750A);	// @ (0xEA1 * 8 + 2)
#define                                 S26C2_bit           _BIT_ACCESS(LCDDATA19,2)
// LCDDATA27<S26C3>
extern volatile __bit                   S26C3               __at(0x754A);	// @ (0xEA9 * 8 + 2)
#define                                 S26C3_bit           _BIT_ACCESS(LCDDATA27,2)
// LCDDATA35<S26C4>
extern volatile __bit                   S26C4               __at(0x758A);	// @ (0xEB1 * 8 + 2)
#define                                 S26C4_bit           _BIT_ACCESS(LCDDATA35,2)
// LCDDATA43<S26C5>
extern volatile __bit                   S26C5               __at(0x75CA);	// @ (0xEB9 * 8 + 2)
#define                                 S26C5_bit           _BIT_ACCESS(LCDDATA43,2)
// LCDDATA51<S26C6>
extern volatile __bit                   S26C6               __at(0x760A);	// @ (0xEC1 * 8 + 2)
#define                                 S26C6_bit           _BIT_ACCESS(LCDDATA51,2)
// LCDDATA59<S26C7>
extern volatile __bit                   S26C7               __at(0x764A);	// @ (0xEC9 * 8 + 2)
#define                                 S26C7_bit           _BIT_ACCESS(LCDDATA59,2)
// LCDDATA3<S27C0>
extern volatile __bit                   S27C0               __at(0x748B);	// @ (0xE91 * 8 + 3)
#define                                 S27C0_bit           _BIT_ACCESS(LCDDATA3,3)
// LCDDATA11<S27C1>
extern volatile __bit                   S27C1               __at(0x74CB);	// @ (0xE99 * 8 + 3)
#define                                 S27C1_bit           _BIT_ACCESS(LCDDATA11,3)
// LCDDATA19<S27C2>
extern volatile __bit                   S27C2               __at(0x750B);	// @ (0xEA1 * 8 + 3)
#define                                 S27C2_bit           _BIT_ACCESS(LCDDATA19,3)
// LCDDATA27<S27C3>
extern volatile __bit                   S27C3               __at(0x754B);	// @ (0xEA9 * 8 + 3)
#define                                 S27C3_bit           _BIT_ACCESS(LCDDATA27,3)
// LCDDATA35<S27C4>
extern volatile __bit                   S27C4               __at(0x758B);	// @ (0xEB1 * 8 + 3)
#define                                 S27C4_bit           _BIT_ACCESS(LCDDATA35,3)
// LCDDATA43<S27C5>
extern volatile __bit                   S27C5               __at(0x75CB);	// @ (0xEB9 * 8 + 3)
#define                                 S27C5_bit           _BIT_ACCESS(LCDDATA43,3)
// LCDDATA51<S27C6>
extern volatile __bit                   S27C6               __at(0x760B);	// @ (0xEC1 * 8 + 3)
#define                                 S27C6_bit           _BIT_ACCESS(LCDDATA51,3)
// LCDDATA59<S27C7>
extern volatile __bit                   S27C7               __at(0x764B);	// @ (0xEC9 * 8 + 3)
#define                                 S27C7_bit           _BIT_ACCESS(LCDDATA59,3)
// LCDDATA3<S28C0>
extern volatile __bit                   S28C0               __at(0x748C);	// @ (0xE91 * 8 + 4)
#define                                 S28C0_bit           _BIT_ACCESS(LCDDATA3,4)
// LCDDATA11<S28C1>
extern volatile __bit                   S28C1               __at(0x74CC);	// @ (0xE99 * 8 + 4)
#define                                 S28C1_bit           _BIT_ACCESS(LCDDATA11,4)
// LCDDATA19<S28C2>
extern volatile __bit                   S28C2               __at(0x750C);	// @ (0xEA1 * 8 + 4)
#define                                 S28C2_bit           _BIT_ACCESS(LCDDATA19,4)
// LCDDATA27<S28C3>
extern volatile __bit                   S28C3               __at(0x754C);	// @ (0xEA9 * 8 + 4)
#define                                 S28C3_bit           _BIT_ACCESS(LCDDATA27,4)
// LCDDATA35<S28C4>
extern volatile __bit                   S28C4               __at(0x758C);	// @ (0xEB1 * 8 + 4)
#define                                 S28C4_bit           _BIT_ACCESS(LCDDATA35,4)
// LCDDATA43<S28C5>
extern volatile __bit                   S28C5               __at(0x75CC);	// @ (0xEB9 * 8 + 4)
#define                                 S28C5_bit           _BIT_ACCESS(LCDDATA43,4)
// LCDDATA51<S28C6>
extern volatile __bit                   S28C6               __at(0x760C);	// @ (0xEC1 * 8 + 4)
#define                                 S28C6_bit           _BIT_ACCESS(LCDDATA51,4)
// LCDDATA59<S28C7>
extern volatile __bit                   S28C7               __at(0x764C);	// @ (0xEC9 * 8 + 4)
#define                                 S28C7_bit           _BIT_ACCESS(LCDDATA59,4)
// LCDDATA3<S29C0>
extern volatile __bit                   S29C0               __at(0x748D);	// @ (0xE91 * 8 + 5)
#define                                 S29C0_bit           _BIT_ACCESS(LCDDATA3,5)
// LCDDATA11<S29C1>
extern volatile __bit                   S29C1               __at(0x74CD);	// @ (0xE99 * 8 + 5)
#define                                 S29C1_bit           _BIT_ACCESS(LCDDATA11,5)
// LCDDATA19<S29C2>
extern volatile __bit                   S29C2               __at(0x750D);	// @ (0xEA1 * 8 + 5)
#define                                 S29C2_bit           _BIT_ACCESS(LCDDATA19,5)
// LCDDATA27<S29C3>
extern volatile __bit                   S29C3               __at(0x754D);	// @ (0xEA9 * 8 + 5)
#define                                 S29C3_bit           _BIT_ACCESS(LCDDATA27,5)
// LCDDATA35<S29C4>
extern volatile __bit                   S29C4               __at(0x758D);	// @ (0xEB1 * 8 + 5)
#define                                 S29C4_bit           _BIT_ACCESS(LCDDATA35,5)
// LCDDATA43<S29C5>
extern volatile __bit                   S29C5               __at(0x75CD);	// @ (0xEB9 * 8 + 5)
#define                                 S29C5_bit           _BIT_ACCESS(LCDDATA43,5)
// LCDDATA51<S29C6>
extern volatile __bit                   S29C6               __at(0x760D);	// @ (0xEC1 * 8 + 5)
#define                                 S29C6_bit           _BIT_ACCESS(LCDDATA51,5)
// LCDDATA59<S29C7>
extern volatile __bit                   S29C7               __at(0x764D);	// @ (0xEC9 * 8 + 5)
#define                                 S29C7_bit           _BIT_ACCESS(LCDDATA59,5)
// LCDDATA3<S30C0>
extern volatile __bit                   S30C0               __at(0x748E);	// @ (0xE91 * 8 + 6)
#define                                 S30C0_bit           _BIT_ACCESS(LCDDATA3,6)
// LCDDATA11<S30C1>
extern volatile __bit                   S30C1               __at(0x74CE);	// @ (0xE99 * 8 + 6)
#define                                 S30C1_bit           _BIT_ACCESS(LCDDATA11,6)
// LCDDATA19<S30C2>
extern volatile __bit                   S30C2               __at(0x750E);	// @ (0xEA1 * 8 + 6)
#define                                 S30C2_bit           _BIT_ACCESS(LCDDATA19,6)
// LCDDATA27<S30C3>
extern volatile __bit                   S30C3               __at(0x754E);	// @ (0xEA9 * 8 + 6)
#define                                 S30C3_bit           _BIT_ACCESS(LCDDATA27,6)
// LCDDATA35<S30C4>
extern volatile __bit                   S30C4               __at(0x758E);	// @ (0xEB1 * 8 + 6)
#define                                 S30C4_bit           _BIT_ACCESS(LCDDATA35,6)
// LCDDATA43<S30C5>
extern volatile __bit                   S30C5               __at(0x75CE);	// @ (0xEB9 * 8 + 6)
#define                                 S30C5_bit           _BIT_ACCESS(LCDDATA43,6)
// LCDDATA51<S30C6>
extern volatile __bit                   S30C6               __at(0x760E);	// @ (0xEC1 * 8 + 6)
#define                                 S30C6_bit           _BIT_ACCESS(LCDDATA51,6)
// LCDDATA59<S30C7>
extern volatile __bit                   S30C7               __at(0x764E);	// @ (0xEC9 * 8 + 6)
#define                                 S30C7_bit           _BIT_ACCESS(LCDDATA59,6)
// LCDDATA3<S31C0>
extern volatile __bit                   S31C0               __at(0x748F);	// @ (0xE91 * 8 + 7)
#define                                 S31C0_bit           _BIT_ACCESS(LCDDATA3,7)
// LCDDATA11<S31C1>
extern volatile __bit                   S31C1               __at(0x74CF);	// @ (0xE99 * 8 + 7)
#define                                 S31C1_bit           _BIT_ACCESS(LCDDATA11,7)
// LCDDATA19<S31C2>
extern volatile __bit                   S31C2               __at(0x750F);	// @ (0xEA1 * 8 + 7)
#define                                 S31C2_bit           _BIT_ACCESS(LCDDATA19,7)
// LCDDATA27<S31C3>
extern volatile __bit                   S31C3               __at(0x754F);	// @ (0xEA9 * 8 + 7)
#define                                 S31C3_bit           _BIT_ACCESS(LCDDATA27,7)
// LCDDATA35<S31C4>
extern volatile __bit                   S31C4               __at(0x758F);	// @ (0xEB1 * 8 + 7)
#define                                 S31C4_bit           _BIT_ACCESS(LCDDATA35,7)
// LCDDATA43<S31C5>
extern volatile __bit                   S31C5               __at(0x75CF);	// @ (0xEB9 * 8 + 7)
#define                                 S31C5_bit           _BIT_ACCESS(LCDDATA43,7)
// LCDDATA51<S31C6>
extern volatile __bit                   S31C6               __at(0x760F);	// @ (0xEC1 * 8 + 7)
#define                                 S31C6_bit           _BIT_ACCESS(LCDDATA51,7)
// LCDDATA59<S31C7>
extern volatile __bit                   S31C7               __at(0x764F);	// @ (0xEC9 * 8 + 7)
#define                                 S31C7_bit           _BIT_ACCESS(LCDDATA59,7)
// LCDDATA4<S32C0>
extern volatile __bit                   S32C0               __at(0x7490);	// @ (0xE92 * 8 + 0)
#define                                 S32C0_bit           _BIT_ACCESS(LCDDATA4,0)
// LCDDATA12<S32C1>
extern volatile __bit                   S32C1               __at(0x74D0);	// @ (0xE9A * 8 + 0)
#define                                 S32C1_bit           _BIT_ACCESS(LCDDATA12,0)
// LCDDATA20<S32C2>
extern volatile __bit                   S32C2               __at(0x7510);	// @ (0xEA2 * 8 + 0)
#define                                 S32C2_bit           _BIT_ACCESS(LCDDATA20,0)
// LCDDATA28<S32C3>
extern volatile __bit                   S32C3               __at(0x7550);	// @ (0xEAA * 8 + 0)
#define                                 S32C3_bit           _BIT_ACCESS(LCDDATA28,0)
// LCDDATA36<S32C4>
extern volatile __bit                   S32C4               __at(0x7590);	// @ (0xEB2 * 8 + 0)
#define                                 S32C4_bit           _BIT_ACCESS(LCDDATA36,0)
// LCDDATA44<S32C5>
extern volatile __bit                   S32C5               __at(0x75D0);	// @ (0xEBA * 8 + 0)
#define                                 S32C5_bit           _BIT_ACCESS(LCDDATA44,0)
// LCDDATA52<S32C6>
extern volatile __bit                   S32C6               __at(0x7610);	// @ (0xEC2 * 8 + 0)
#define                                 S32C6_bit           _BIT_ACCESS(LCDDATA52,0)
// LCDDATA60<S32C7>
extern volatile __bit                   S32C7               __at(0x7650);	// @ (0xECA * 8 + 0)
#define                                 S32C7_bit           _BIT_ACCESS(LCDDATA60,0)
// LCDDATA4<S33C0>
extern volatile __bit                   S33C0               __at(0x7491);	// @ (0xE92 * 8 + 1)
#define                                 S33C0_bit           _BIT_ACCESS(LCDDATA4,1)
// LCDDATA12<S33C1>
extern volatile __bit                   S33C1               __at(0x74D1);	// @ (0xE9A * 8 + 1)
#define                                 S33C1_bit           _BIT_ACCESS(LCDDATA12,1)
// LCDDATA20<S33C2>
extern volatile __bit                   S33C2               __at(0x7511);	// @ (0xEA2 * 8 + 1)
#define                                 S33C2_bit           _BIT_ACCESS(LCDDATA20,1)
// LCDDATA28<S33C3>
extern volatile __bit                   S33C3               __at(0x7551);	// @ (0xEAA * 8 + 1)
#define                                 S33C3_bit           _BIT_ACCESS(LCDDATA28,1)
// LCDDATA36<S33C4>
extern volatile __bit                   S33C4               __at(0x7591);	// @ (0xEB2 * 8 + 1)
#define                                 S33C4_bit           _BIT_ACCESS(LCDDATA36,1)
// LCDDATA44<S33C5>
extern volatile __bit                   S33C5               __at(0x75D1);	// @ (0xEBA * 8 + 1)
#define                                 S33C5_bit           _BIT_ACCESS(LCDDATA44,1)
// LCDDATA52<S33C6>
extern volatile __bit                   S33C6               __at(0x7611);	// @ (0xEC2 * 8 + 1)
#define                                 S33C6_bit           _BIT_ACCESS(LCDDATA52,1)
// LCDDATA60<S33C7>
extern volatile __bit                   S33C7               __at(0x7651);	// @ (0xECA * 8 + 1)
#define                                 S33C7_bit           _BIT_ACCESS(LCDDATA60,1)
// LCDDATA4<S34C0>
extern volatile __bit                   S34C0               __at(0x7492);	// @ (0xE92 * 8 + 2)
#define                                 S34C0_bit           _BIT_ACCESS(LCDDATA4,2)
// LCDDATA12<S34C1>
extern volatile __bit                   S34C1               __at(0x74D2);	// @ (0xE9A * 8 + 2)
#define                                 S34C1_bit           _BIT_ACCESS(LCDDATA12,2)
// LCDDATA20<S34C2>
extern volatile __bit                   S34C2               __at(0x7512);	// @ (0xEA2 * 8 + 2)
#define                                 S34C2_bit           _BIT_ACCESS(LCDDATA20,2)
// LCDDATA28<S34C3>
extern volatile __bit                   S34C3               __at(0x7552);	// @ (0xEAA * 8 + 2)
#define                                 S34C3_bit           _BIT_ACCESS(LCDDATA28,2)
// LCDDATA36<S34C4>
extern volatile __bit                   S34C4               __at(0x7592);	// @ (0xEB2 * 8 + 2)
#define                                 S34C4_bit           _BIT_ACCESS(LCDDATA36,2)
// LCDDATA44<S34C5>
extern volatile __bit                   S34C5               __at(0x75D2);	// @ (0xEBA * 8 + 2)
#define                                 S34C5_bit           _BIT_ACCESS(LCDDATA44,2)
// LCDDATA52<S34C6>
extern volatile __bit                   S34C6               __at(0x7612);	// @ (0xEC2 * 8 + 2)
#define                                 S34C6_bit           _BIT_ACCESS(LCDDATA52,2)
// LCDDATA60<S34C7>
extern volatile __bit                   S34C7               __at(0x7652);	// @ (0xECA * 8 + 2)
#define                                 S34C7_bit           _BIT_ACCESS(LCDDATA60,2)
// LCDDATA4<S35C0>
extern volatile __bit                   S35C0               __at(0x7493);	// @ (0xE92 * 8 + 3)
#define                                 S35C0_bit           _BIT_ACCESS(LCDDATA4,3)
// LCDDATA12<S35C1>
extern volatile __bit                   S35C1               __at(0x74D3);	// @ (0xE9A * 8 + 3)
#define                                 S35C1_bit           _BIT_ACCESS(LCDDATA12,3)
// LCDDATA20<S35C2>
extern volatile __bit                   S35C2               __at(0x7513);	// @ (0xEA2 * 8 + 3)
#define                                 S35C2_bit           _BIT_ACCESS(LCDDATA20,3)
// LCDDATA28<S35C3>
extern volatile __bit                   S35C3               __at(0x7553);	// @ (0xEAA * 8 + 3)
#define                                 S35C3_bit           _BIT_ACCESS(LCDDATA28,3)
// LCDDATA36<S35C4>
extern volatile __bit                   S35C4               __at(0x7593);	// @ (0xEB2 * 8 + 3)
#define                                 S35C4_bit           _BIT_ACCESS(LCDDATA36,3)
// LCDDATA44<S35C5>
extern volatile __bit                   S35C5               __at(0x75D3);	// @ (0xEBA * 8 + 3)
#define                                 S35C5_bit           _BIT_ACCESS(LCDDATA44,3)
// LCDDATA52<S35C6>
extern volatile __bit                   S35C6               __at(0x7613);	// @ (0xEC2 * 8 + 3)
#define                                 S35C6_bit           _BIT_ACCESS(LCDDATA52,3)
// LCDDATA60<S35C7>
extern volatile __bit                   S35C7               __at(0x7653);	// @ (0xECA * 8 + 3)
#define                                 S35C7_bit           _BIT_ACCESS(LCDDATA60,3)
// LCDDATA4<S36C0>
extern volatile __bit                   S36C0               __at(0x7494);	// @ (0xE92 * 8 + 4)
