MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J94/mcu.h
#define                                 U3TXR3_bit          _BIT_ACCESS(RPINR4_5,7)
// RPINR6_7<U4RXR0>
extern volatile __bit                   U4RXR0              __at(0x7168);	// @ (0xE2D * 8 + 0)
#define                                 U4RXR0_bit          _BIT_ACCESS(RPINR6_7,0)
// RPINR6_7<U4RXR1>
extern volatile __bit                   U4RXR1              __at(0x7169);	// @ (0xE2D * 8 + 1)
#define                                 U4RXR1_bit          _BIT_ACCESS(RPINR6_7,1)
// RPINR6_7<U4RXR2>
extern volatile __bit                   U4RXR2              __at(0x716A);	// @ (0xE2D * 8 + 2)
#define                                 U4RXR2_bit          _BIT_ACCESS(RPINR6_7,2)
// RPINR6_7<U4RXR3>
extern volatile __bit                   U4RXR3              __at(0x716B);	// @ (0xE2D * 8 + 3)
#define                                 U4RXR3_bit          _BIT_ACCESS(RPINR6_7,3)
// RPINR6_7<U4TXR0>
extern volatile __bit                   U4TXR0              __at(0x716C);	// @ (0xE2D * 8 + 4)
#define                                 U4TXR0_bit          _BIT_ACCESS(RPINR6_7,4)
// RPINR6_7<U4TXR1>
extern volatile __bit                   U4TXR1              __at(0x716D);	// @ (0xE2D * 8 + 5)
#define                                 U4TXR1_bit          _BIT_ACCESS(RPINR6_7,5)
// RPINR6_7<U4TXR2>
extern volatile __bit                   U4TXR2              __at(0x716E);	// @ (0xE2D * 8 + 6)
#define                                 U4TXR2_bit          _BIT_ACCESS(RPINR6_7,6)
// RPINR6_7<U4TXR3>
extern volatile __bit                   U4TXR3              __at(0x716F);	// @ (0xE2D * 8 + 7)
#define                                 U4TXR3_bit          _BIT_ACCESS(RPINR6_7,7)
// SSP1STAT<UA1>
extern volatile __bit                   UA1                 __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 UA1_bit             _BIT_ACCESS(SSP1STAT,1)
// SSP2STAT<UA2>
extern volatile __bit                   UA2                 __at(0x78D1);	// @ (0xF1A * 8 + 1)
#define                                 UA2_bit             _BIT_ACCESS(SSP2STAT,1)
// PMD1<UART1MD>
extern volatile __bit                   UART1MD             __at(0x779A);	// @ (0xEF3 * 8 + 2)
#define                                 UART1MD_bit         _BIT_ACCESS(PMD1,2)
// PMD1<UART2MD>
extern volatile __bit                   UART2MD             __at(0x779B);	// @ (0xEF3 * 8 + 3)
#define                                 UART2MD_bit         _BIT_ACCESS(PMD1,3)
// PMD1<UART3MD>
extern volatile __bit                   UART3MD             __at(0x779C);	// @ (0xEF3 * 8 + 4)
#define                                 UART3MD_bit         _BIT_ACCESS(PMD1,4)
// PMD1<UART4MD>
extern volatile __bit                   UART4MD             __at(0x779D);	// @ (0xEF3 * 8 + 5)
#define                                 UART4MD_bit         _BIT_ACCESS(PMD1,5)
// UIE<UERRIE>
extern volatile __bit                   UERRIE              __at(0x7081);	// @ (0xE10 * 8 + 1)
#define                                 UERRIE_bit          _BIT_ACCESS(UIE,1)
// UIR<UERRIF>
extern volatile __bit                   UERRIF              __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 UERRIF_bit          _BIT_ACCESS(UIR,1)
// DSCONL<ULPWDIS>
extern volatile __bit                   ULPWDIS             __at(0x7942);	// @ (0xF28 * 8 + 2)
#define                                 ULPWDIS_bit         _BIT_ACCESS(DSCONL,2)
// PORTA<ULPWUIN>
extern volatile __bit                   ULPWUIN             __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 ULPWUIN_bit         _BIT_ACCESS(PORTA,0)
// UCFG<UOEMON>
extern volatile __bit                   UOEMON              __at(0x708E);	// @ (0xE11 * 8 + 6)
#define                                 UOEMON_bit          _BIT_ACCESS(UCFG,6)
// UCFG<UPP0>
extern volatile __bit                   UPP0                __at(0x7088);	// @ (0xE11 * 8 + 0)
#define                                 UPP0_bit            _BIT_ACCESS(UCFG,0)
// UCFG<UPP1>
extern volatile __bit                   UPP1                __at(0x7089);	// @ (0xE11 * 8 + 1)
#define                                 UPP1_bit            _BIT_ACCESS(UCFG,1)
// UCFG<UPUEN>
extern volatile __bit                   UPUEN               __at(0x708C);	// @ (0xE11 * 8 + 4)
#define                                 UPUEN_bit           _BIT_ACCESS(UCFG,4)
// UIE<URSTIE>
extern volatile __bit                   URSTIE              __at(0x7080);	// @ (0xE10 * 8 + 0)
#define                                 URSTIE_bit          _BIT_ACCESS(UIE,0)
// UIR<URSTIF>
extern volatile __bit                   URSTIF              __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 URSTIF_bit          _BIT_ACCESS(UIR,0)
// ODCON1<USART1OD>
extern volatile __bit                   USART1OD            __at(0x775A);	// @ (0xEEB * 8 + 2)
#define                                 USART1OD_bit        _BIT_ACCESS(ODCON1,2)
// ODCON1<USART2OD>
extern volatile __bit                   USART2OD            __at(0x775B);	// @ (0xEEB * 8 + 3)
#define                                 USART2OD_bit        _BIT_ACCESS(ODCON1,3)
// ODCON1<USART3OD>
extern volatile __bit                   USART3OD            __at(0x775C);	// @ (0xEEB * 8 + 4)
#define                                 USART3OD_bit        _BIT_ACCESS(ODCON1,4)
// ODCON1<USART4OD>
extern volatile __bit                   USART4OD            __at(0x775D);	// @ (0xEEB * 8 + 5)
#define                                 USART4OD_bit        _BIT_ACCESS(ODCON1,5)
// UCON<USBEN>
extern volatile __bit                   USBEN               __at(0x7BAB);	// @ (0xF75 * 8 + 3)
#define                                 USBEN_bit           _BIT_ACCESS(UCON,3)
// PIE2<USBIE>
extern volatile __bit                   USBIE               __at(0x7D04);	// @ (0xFA0 * 8 + 4)
#define                                 USBIE_bit           _BIT_ACCESS(PIE2,4)
// PIR2<USBIF>
extern volatile __bit                   USBIF               __at(0x7D0C);	// @ (0xFA1 * 8 + 4)
#define                                 USBIF_bit           _BIT_ACCESS(PIR2,4)
// IPR2<USBIP>
extern volatile __bit                   USBIP               __at(0x7D14);	// @ (0xFA2 * 8 + 4)
#define                                 USBIP_bit           _BIT_ACCESS(IPR2,4)
// PMD4<USBMD>
extern volatile __bit                   USBMD               __at(0x7784);	// @ (0xEF0 * 8 + 4)
#define                                 USBMD_bit           _BIT_ACCESS(PMD4,4)
// UCFG<UTEYE>
extern volatile __bit                   UTEYE               __at(0x708F);	// @ (0xE11 * 8 + 7)
#define                                 UTEYE_bit           _BIT_ACCESS(UCFG,7)
// UCFG<UTRDIS>
extern volatile __bit                   UTRDIS              __at(0x708B);	// @ (0xE11 * 8 + 3)
#define                                 UTRDIS_bit          _BIT_ACCESS(UCFG,3)
// RCON3<VBAT>
extern volatile __bit                   VBAT                __at(0x7BE0);	// @ (0xF7C * 8 + 0)
#define                                 VBAT_bit            _BIT_ACCESS(RCON3,0)
// ANCFG<VBG2EN>
extern volatile __bit                   VBG2EN              __at(0x7809);	// @ (0xF01 * 8 + 1)
#define                                 VBG2EN_bit          _BIT_ACCESS(ANCFG,1)
// ANCFG<VBG6EN>
extern volatile __bit                   VBG6EN              __at(0x780A);	// @ (0xF01 * 8 + 2)
#define                                 VBG6EN_bit          _BIT_ACCESS(ANCFG,2)
// ANCFG<VBGEN>
extern volatile __bit                   VBGEN               __at(0x7808);	// @ (0xF01 * 8 + 0)
#define                                 VBGEN_bit           _BIT_ACCESS(ANCFG,0)
// RCON3<VBPOR>
extern volatile __bit                   VBPOR               __at(0x7BE1);	// @ (0xF7C * 8 + 1)
#define                                 VBPOR_bit           _BIT_ACCESS(RCON3,1)
// RCON3<VDDBOR>
extern volatile __bit                   VDDBOR              __at(0x7BE3);	// @ (0xF7C * 8 + 3)
#define                                 VDDBOR_bit          _BIT_ACCESS(RCON3,3)
// RCON3<VDDPOR>
extern volatile __bit                   VDDPOR              __at(0x7BE2);	// @ (0xF7C * 8 + 2)
#define                                 VDDPOR_bit          _BIT_ACCESS(RCON3,2)
// HLVDCON<VDIRMAG>
extern volatile __bit                   VDIRMAG             __at(0x7D47);	// @ (0xFA8 * 8 + 7)
#define                                 VDIRMAG_bit         _BIT_ACCESS(HLVDCON,7)
// LCDREF<VLCD1PE>
extern volatile __bit                   VLCD1PE             __at(0x76B8);	// @ (0xED7 * 8 + 0)
#define                                 VLCD1PE_bit         _BIT_ACCESS(LCDREF,0)
// LCDREF<VLCD2PE>
extern volatile __bit                   VLCD2PE             __at(0x76B9);	// @ (0xED7 * 8 + 1)
#define                                 VLCD2PE_bit         _BIT_ACCESS(LCDREF,1)
// LCDREF<VLCD3PE>
extern volatile __bit                   VLCD3PE             __at(0x76BA);	// @ (0xED7 * 8 + 2)
#define                                 VLCD3PE_bit         _BIT_ACCESS(LCDREF,2)
// LCDPS<WA>
extern volatile __bit                   WA                  __at(0x76D4);	// @ (0xEDA * 8 + 4)
#define                                 WA_bit              _BIT_ACCESS(LCDPS,4)
// PR2<WAIT0>
extern volatile __bit                   WAIT0               __at(0x7E5C);	// @ (0xFCB * 8 + 4)
#define                                 WAIT0_bit           _BIT_ACCESS(PR2,4)
// PR2<WAIT1>
extern volatile __bit                   WAIT1               __at(0x7E5D);	// @ (0xFCB * 8 + 5)
#define                                 WAIT1_bit           _BIT_ACCESS(PR2,5)
// RTCVALH<WAITB0>
extern volatile __bit                   WAITB0              __at(0x7AEE);	// @ (0xF5D * 8 + 6)
#define                                 WAITB0_bit          _BIT_ACCESS(RTCVALH,6)
// RTCVALH<WAITB1>
extern volatile __bit                   WAITB1              __at(0x7AEF);	// @ (0xF5D * 8 + 7)
#define                                 WAITB1_bit          _BIT_ACCESS(RTCVALH,7)
// RTCVALH<WAITE0>
extern volatile __bit                   WAITE0              __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 WAITE0_bit          _BIT_ACCESS(RTCVALH,0)
// RTCVALH<WAITE1>
extern volatile __bit                   WAITE1              __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 WAITE1_bit          _BIT_ACCESS(RTCVALH,1)
// RTCVALH<WAITM0>
extern volatile __bit                   WAITM0              __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 WAITM0_bit          _BIT_ACCESS(RTCVALH,2)
// RTCVALH<WAITM1>
extern volatile __bit                   WAITM1              __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 WAITM1_bit          _BIT_ACCESS(RTCVALH,3)
// RTCVALH<WAITM2>
extern volatile __bit                   WAITM2              __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 WAITM2_bit          _BIT_ACCESS(RTCVALH,4)
// RTCVALH<WAITM3>
extern volatile __bit                   WAITM3              __at(0x7AED);	// @ (0xF5D * 8 + 5)
#define                                 WAITM3_bit          _BIT_ACCESS(RTCVALH,5)
// SSP1CON1<WCOL1>
extern volatile __bit                   WCOL1               __at(0x7E37);	// @ (0xFC6 * 8 + 7)
#define                                 WCOL1_bit           _BIT_ACCESS(SSP1CON1,7)
// SSP2CON1<WCOL2>
extern volatile __bit                   WCOL2               __at(0x78CF);	// @ (0xF19 * 8 + 7)
#define                                 WCOL2_bit           _BIT_ACCESS(SSP2CON1,7)
// LCDCON<WERR>
extern volatile __bit                   WERR                __at(0x76CD);	// @ (0xED9 * 8 + 5)
#define                                 WERR_bit            _BIT_ACCESS(LCDCON,5)
// LCDPS<WFT>
extern volatile __bit                   WFT                 __at(0x76D7);	// @ (0xEDA * 8 + 7)
#define                                 WFT_bit             _BIT_ACCESS(LCDPS,7)
// WPUB<WPUB0>
extern volatile __bit                   WPUB0               __at(0x7B10);	// @ (0xF62 * 8 + 0)
#define                                 WPUB0_bit           _BIT_ACCESS(WPUB,0)
// WPUB<WPUB1>
extern volatile __bit                   WPUB1               __at(0x7B11);	// @ (0xF62 * 8 + 1)
#define                                 WPUB1_bit           _BIT_ACCESS(WPUB,1)
// WPUB<WPUB2>
extern volatile __bit                   WPUB2               __at(0x7B12);	// @ (0xF62 * 8 + 2)
#define                                 WPUB2_bit           _BIT_ACCESS(WPUB,2)
// WPUB<WPUB3>
extern volatile __bit                   WPUB3               __at(0x7B13);	// @ (0xF62 * 8 + 3)
#define                                 WPUB3_bit           _BIT_ACCESS(WPUB,3)
// WPUB<WPUB4>
extern volatile __bit                   WPUB4               __at(0x7B14);	// @ (0xF62 * 8 + 4)
#define                                 WPUB4_bit           _BIT_ACCESS(WPUB,4)
// WPUB<WPUB5>
extern volatile __bit                   WPUB5               __at(0x7B15);	// @ (0xF62 * 8 + 5)
#define                                 WPUB5_bit           _BIT_ACCESS(WPUB,5)
// WPUB<WPUB6>
extern volatile __bit                   WPUB6               __at(0x7B16);	// @ (0xF62 * 8 + 6)
#define                                 WPUB6_bit           _BIT_ACCESS(WPUB,6)
// WPUB<WPUB7>
extern volatile __bit                   WPUB7               __at(0x7B17);	// @ (0xF62 * 8 + 7)
#define                                 WPUB7_bit           _BIT_ACCESS(WPUB,7)
// EECON1<WR>
extern volatile __bit                   WR                  __at(0x7BF9);	// @ (0xF7F * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(EECON1,1)
// PORTE<WRE>
extern volatile __bit                   WRE                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 WRE_bit             _BIT_ACCESS(PORTE,1)
// EECON1<WREN>
extern volatile __bit                   WREN                __at(0x7BFA);	// @ (0xF7F * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(EECON1,2)
// EECON1<WRERR>
extern volatile __bit                   WRERR               __at(0x7BFB);	// @ (0xF7F * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(EECON1,3)
// BAUDCON1<WUE1>
extern volatile __bit                   WUE1                __at(0x7B39);	// @ (0xF67 * 8 + 1)
#define                                 WUE1_bit            _BIT_ACCESS(BAUDCON1,1)
// BAUDCON2<WUE2>
extern volatile __bit                   WUE2                __at(0x7989);	// @ (0xF31 * 8 + 1)
#define                                 WUE2_bit            _BIT_ACCESS(BAUDCON2,1)
// BAUDCON3<WUE3>
extern volatile __bit                   WUE3                __at(0x7969);	// @ (0xF2D * 8 + 1)
#define                                 WUE3_bit            _BIT_ACCESS(BAUDCON3,1)
// BAUDCON4<WUE4>
extern volatile __bit                   WUE4                __at(0x77E9);	// @ (0xEFD * 8 + 1)
#define                                 WUE4_bit            _BIT_ACCESS(BAUDCON4,1)
// EECON1<WWPROG>
extern volatile __bit                   WWPROG              __at(0x7BFD);	// @ (0xF7F * 8 + 5)
#define                                 WWPROG_bit          _BIT_ACCESS(EECON1,5)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x7EC2);	// @ (0xFD8 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// SSP1STAT<nADDRESS1>
extern volatile __bit                   nADDRESS1           __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 nADDRESS1_bit       _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<nADDRESS2>
extern volatile __bit                   nADDRESS2           __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 nADDRESS2_bit       _BIT_ACCESS(SSP2STAT,5)
// RCON<nBOR>
extern volatile __bit                   nBOR                __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(RCON,0)
// RCON<nCM>
extern volatile __bit                   nCM                 __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 nCM_bit             _BIT_ACCESS(RCON,5)
// RCON<nPD>
extern volatile __bit                   nPD                 __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 nPD_bit             _BIT_ACCESS(RCON,2)
// RCON<nPOR>
extern volatile __bit                   nPOR                __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(RCON,1)
// INTCON2<nRBPU>
extern volatile __bit                   nRBPU               __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 nRBPU_bit           _BIT_ACCESS(INTCON2,7)
// RCON<nRI>
extern volatile __bit                   nRI                 __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 nRI_bit             _BIT_ACCESS(RCON,4)
// T1GCON<nT1DONE>
extern volatile __bit                   nT1DONE             __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 nT1DONE_bit         _BIT_ACCESS(T1GCON,3)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// T3GCON<nT3DONE>
extern volatile __bit                   nT3DONE             __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 nT3DONE_bit         _BIT_ACCESS(T3GCON,3)
// T3CON<nT3SYNC>
extern volatile __bit                   nT3SYNC             __at(0x7D8A);	// @ (0xFB1 * 8 + 2)
#define                                 nT3SYNC_bit         _BIT_ACCESS(T3CON,2)
// T5GCON<nT5DONE>
extern volatile __bit                   nT5DONE             __at(0x789B);	// @ (0xF13 * 8 + 3)
#define                                 nT5DONE_bit         _BIT_ACCESS(T5GCON,3)
// T5CON<nT5SYNC>
extern volatile __bit                   nT5SYNC             __at(0x78A2);	// @ (0xF14 * 8 + 2)
#define                                 nT5SYNC_bit         _BIT_ACCESS(T5CON,2)
// RCON<nTO>
extern volatile __bit                   nTO                 __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 nTO_bit             _BIT_ACCESS(RCON,3)
// SSP1STAT<nWRITE1>
extern volatile __bit                   nWRITE1             __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 nWRITE1_bit         _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<nWRITE2>
extern volatile __bit                   nWRITE2             __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 nWRITE2_bit         _BIT_ACCESS(SSP2STAT,2)

#endif // _PIC18F67J94_H_
